// description.h
// Copyright (c) 2006 Krodo
// Part of Bylins http://www.mud.ru

#ifndef _DESCRIPTION_H_INCLUDED
#define _DESCRIPTION_H_INCLUDED

#include "engine/core/conf.h"
#include <string>
#include <vector>
#include <map>

/**
* пЁп╩п╬п╠п╟п╩я▄п╫я▀п╧ п╨п╩п╟я│я│-п╨п╬п╫я┌п╣п╧п╫п╣я─ я┐п╫п╦п╨п╟п╩я▄п╫я▀я┘ п╬п©п╦я│п╟п╫п╦п╧ п╨п╬п╪п╫п╟я┌, я┌я┐п©п╬ я█п╨п╬п╫п╬п╪п╦я┌ 70+п╪п╠ п©п╟п╪я▐я┌п╦.
* п╢п╣п╧я│я┌п╡п╦я▐: пЁя─я┐п╥п╦п╪ п╬п©п╦я│п╟п╫п╦я▐ п╨п╬п╪п╫п╟я┌, п©п╬п©я┐я┌п╫п╬ п╬я┌я│п╣п╨п╟я▐ п╢я┐п╠п╩п╦п╨п╟я┌я▀. п╡ п╨п╬п╪п╫п╟я┌я┐ п©п╦я┬п╣я┌я│я▐
* п╫п╣ я│п╟п╪п╬ п╬п©п╦я│п╟п╫п╦п╣, п╟ п╣пЁп╬ п©п╬я─я▐п╢п╨п╬п╡я▀п╧ п╫п╬п╪п╣я─ п╡ пЁп╩п╬п╠п╟п╩я▄п╫п╬п╪ п╪п╟я│я│п╦п╡п╣ я█я┌п╦я┘ п╬п©п╦я│п╟п╫п╦п╧.
* п╣я│п╩п╦ я┐ п╡п╟я│ п╡п╬п╥п╫п╦п╨п╫п╣я┌ п╪я▀я│п╩я▄ п╢п╣п╩п╟я┌я▄ я┌п╬п╤п╣ я│п╟п╪п╬п╣ п©п╬я│я┌я─п╬я┤п╫п╬, я┌п╬ п╫п╣ п╪я┐я┤п╟п╧я┌п╣я│я▄,
* я┌.п╨. п╡я▀ п╫п╦я┤п╣пЁп╬ п╫п╟ я█я┌п╬п╪ п╫п╣ я│я█п╨п╬п╫п╬п╪п╦я┌п╣, п©п╬ п╨я─п╟п╧п╫п╣п╧ п╪п╣я─п╣ я│ я┌п╣п╨я┐я┴п╦п╪ я└п╬я─п╪п╟я┌п╬п╪ п╥п╬п╫.
* п©я─п╦ я─п╣п╢п╟п╨я┌п╦я─п╬п╡п╟п╫п╦п╦ п╡ п╬п╩я├ я│я┌п╟я─я▀п╣ п╬п©п╦я│п╟п╫п╦я▐ п╬я│я┌п╟я▌я┌я│я▐ п╡ п╪п╟я│я│п╦п╡п╣, я┌.п╨. я█я┌п╬ п╡я│п╣ я┘п╣я─п╫я▐

* \todo п▓ п©п╬я│п╩п╣п╢я│я┌п╡п╦п╦ п╫я┐п╤п╫п╬ п©п╣я─п╣п╪п╣я│я┌п╦я┌я▄ п╡ class room, п╟ п©п╬я┌п╬п╪ п╡п╬п╬п╠я┴п╣ я┐п╠я─п╟я┌я▄ п╦п╥ п╨п╬п╢п╟,
* я┌.п╨. п╣я│я┌я▄ п╨я┐п╢п╟ п╠п╬п╩п╣п╣ п©я─п╦п╨п╬п╩я▄п╫п╟я▐ я┌п╣п╪п╟ я│ я┬п╟п╠п╩п╬п╫п╟п╪п╦ п╡ я└п╟п╧п╩п╟я┘ п╥п╬п╫.
*/
class RoomDescription {
 public:
	static size_t add_desc(const std::string &text);
	static const std::string &show_desc(size_t desc_num);

 private:
	RoomDescription();
	~RoomDescription();
	// п╬я┌я│я▌п╢п╟ п╢п╣я─пЁп╟п╣п╪ п╬п©п╦я│п╟п╫п╦я▐ п©я─п╦ я─п╟п╠п╬я┌п╣ п╪п╟п╢п╟
	static std::vector<std::string> _desc_list;
	// п╟ я█я┌п╬ я┤я┌п╬п╠я▀ п╪п╟п╢ п╫п╣ пЁя─я┐п╥п╦п╩я│я▐ п©п╬п╩ я┤п╟я│п╟. п╦п╥-п╥п╟ п╬п©я┌п╦п╪п╦п╥п╟я├п╦п╦ п╨п╬п©п╦я─п╬п╡п╟п╫п╦я▐ я│я┌я─п╬п╨ п╪п╟п©
	// п©я─п╬я┴п╣ п╬я│я┌п╟п╡п╩я▐я┌я▄ п╫п╟ п╡я│п╣ п╡я─п╣п╪я▐ я─п╟п╠п╬я┌я▀ п╪п╟п╢п╟ п╢п╩я▐ п╬п╩я├, п╟ п╪п╬п╤ п╦ п╢п╟п╩я▄п╫п╣п╧я┬п╣пЁп╬ я─п╣п╩п╬п╟п╢п╟ п╬п©п╦я│п╟п╫п╦п╧
	typedef std::map<std::string, size_t> reboot_map_t;
	static reboot_map_t _reboot_map;
};

#endif // _DESCRIPTION_H_INCLUDED

// vim: ts=4 sw=4 tw=0 noet syntax=cpp :
