/************************************************************************ *
*   File: constants.cpp                                 Part of Bylins    *
*  Usage: Numeric and string contants used by the MUD                     *
*                                                                         *
*  All rights reserved.  See license.doc for complete information.        *
*                                                                         *
*  Copyright (C) 1993, 94 by the Trustees of the Johns Hopkins University *
*  CircleMUD is based on DikuMUD, Copyright (C) 1990, 1991.               *
*                                                                         *
*  $Author$                                                        *
*  $Date$                                           *
*  $Revision$                                                       *
************************************************************************ */

#include "conf.h"
#include <array>

#include "constants.h"
#include "spells.h"
#include "skills.h"
#include "interpreter.h"	// alias_data
#include "house.h"

const char *circlemud_version = "CircleMUD, version 3.00 beta patchlevel 16";

int HORSE_VNUM = 4014;
int HORSE_COST = 100;
int START_BREAD = 125;
int CREATE_LIGHT = 126;

//Experience multiplication coefficients
double exp_coefficients[] =
{
	1.0,			//0 remorts
	1.0 / 0.9,		//1 remort
	1.0 / 0.8,		//2 remorts
	1.0 / 0.7,		//3 remorts
	1.0 / 0.6,		//4 remorts
	1.0 / 0.5,		//5 remorts
	1.0 / 0.4,		//6 remorts
	1.0 / 0.3,		//7 remorts
	1.0 / 0.2,		//8 remorts
	1.0 / 0.1,		//9 remorts
	1.0 / 0.09,		//10 remorts
	1.0 / 0.08,		//11 remorts
	1.0 / 0.07,		//12 remorts
	1.0 / 0.06,		//13 remorts
	1.0 / 0.05,		//14 remorts
	1.0 / 0.05		//15 remorts
};




// strings corresponding to ordinals/bitvectors in structs.h **********


// (Note: strings for class definitions in class.c instead of here)


// cardinal directions
const char *dirs[] =
{
	"north",
	"east",
	"south",
	"west",
	"up",
	"down",
	"\n"
};

const char *DirsTo[] =
{
	"на север",
	"на восток",
	"на юг",
	"на запад",
	"вверх",
	"вниз",
	"\n"
};

const char *DirsFrom[] =
{
	"с юга",
	"с запада",
	"с севера",
	"с востока",
	"снизу",
	"сверху",
	"\n"
};


// ROOM_x
const char *room_bits[] =
{
	"темная",
	"ДТ",
	"не для мобов",
	"внутри",
	"мирная",
	"глухая",
	"не выследить",
	"нет магии",
	"однопроходная",
	"телепортация в комнату запрещена",
	"БОГИ",
	"замок",
	"HCRSH",
	"вход в замок",
	"в ОЛС",
	"*",			// BFS MARK
	"для магов",
	"для лекарей",
	"для воров",
	"для богатырей",
	"для наемников",
	"для дружинников",
	"для витязей",
	"для охотников",
	"жертвенник",
	"молельня",
	"для кузнецов",
	"для купцов",
	"для волхвов",
	"арена",
	"\n",
	"не призвать",
	"телепортация из комнаты запрещена",
	"нельзя верхом",
	"внепогодная",
	"медленный ДТ",
	"провалился под лед",
	"не переместиться",
	"слышно арену",
	"транслируем арену",
	"нельзя атаковать",
	"\n",
	"передача вещей запрещена",
	"для русичей",
	"для викингов",
	"для степняков",
	"\n",
	"\n"
};

// EX_x
const char *exit_bits[] =
{
	"есть дверь",
	"закрыта",
	"заперта",
	"не взломать",
	"скрыто",
	"\n"
};


// SECT_
const char *sector_types[] =
{
	"Гладкий пол",
	"Улица",
	"Поле",
	"Лес",
	"Холмы",
	"Горы",
	"Плават. вода",
	"Неплав. вода",
	"В воздухе",
	"Под водой",
	"Скрытая",
	"Мощеная дорога",
	"Утоптанная дорога",
	"Разбитая дорога",
	"\n"
};


/*
 * SEX_x
 * Not used in sprinttype() so no \n.
 */
const char *genders[] = { "бесполое",
						  "мужчина",
						  "женщина",
						  "многоголовый",
						  "\n"
						};


const char *religion_name[][NUM_SEXES] = { {"Язычник", "Язычник", "Язычница", "Язычники"},
	{"Христианин", "Христианин", "Христианка", "Христиане"}
};




// POS_x
const char *position_types[] = { "Мертв",
								 "При смерти",
								 "Без сознания",
								 "В обмороке",
								 "Спит",
								 "Отдыхает",
								 "Сидит",
								 "Сражается",
								 "Стоит",
								 "\n"
							   };

// RESISTANCE_x
const char *resistance_types[] = { "Защита от стихии огня",
								   "Защита от стихии воздуха",
								   "Защита от стихии воды",
								   "Защита от стихии земли",
								   "Живучесть",
								   "Разум",
								   "Иммунитет",
								   "\n"
								 };

// PLR_x
const char *player_bits[] =
{
	"убийца",
	"вор",
	"заморожен",
	"DONTSET",
	"пишет",
	"отправляет письмо",
	"CSH",
	"SITEOK",
	"крики запрещены",
	"титул запрещен",
	"УДАЛЕН",
	"есть точка входа",
	"<null>",
	"не может быть удален",
	"INVST",
	"CRYO",
	"HELL",
	"NAMED",
	"REGED",
	"DUMB",
	"<null>",
	"<null>",
	"<null>",
	"<null>",
	"<null>",
	"<null>",
	"<null>",
	"<null>",
	"*", // reserved for MOB_DELETE
	"*", // reserved for MOB_FREE
	"\n",
	"\n",
	"\n",
	"\n"
};


// MOB_x
const char *action_bits[] = { "спец",
							  "!ходит",
							  "подбирает",
							  "моб",
							  "!заколоть",
							  "агрессивен",
							  "зона",
							  "трус",
							  "агр.днем",
							  "агр.ночью",
							  "агр.полнолуние",
							  "помнит",
							  "помогает",
							  "!очар",
							  "!призывать",
							  "!усыпить",
							  "!сбить",
							  "!ослепить",
							  "скакун",
							  "!оцепенить",
							  "!умолчать",
							  "агр.христиане",
							  "агр.язычники",
							  "!страх",
							  "!групится",
							  "поднят",
							  "лутер",
							  "!убить",
							  "удален",
							  "очищен",
							  "\n",
							  "плавает",
							  "летает",
							  "только в воде",
							  "агр.зимой",
							  "агр.весной",
							  "агр.летом",
							  "агр.осенью",
							  "появл.днем",
							  "появл.ночью",
							  "появл.полнолуние",
							  "появл.зимой",
							  "появл.весной",
							  "появл.летом",
							  "появл.осенью",
							  "!сражается",
							  "снижение экстраатак",
							  "орда",
							  "клон",
							  "!убить.точным.стилем",
							  "!подсечь",
							  "ангел-защитник",
							  "моб-стражник",
							  "игн.печать",
							  "нет.опыта.за.удары",
							  "\n",
							  "огненное дыхание",
							  "зловонное дыхание",
							  "ледяное дыхание",
							  "кислотное дыхание",
							  "ослепляющее дыхание",
							  "!тренируются умения",
							  "!отдыхает",
							  "массовая атака",
							  "!оглушить",
							  "!помогают",
							  "открывает двери",
							  "игнорирует !моб",
							  "игнорирует мирные",
							  "оживлен",
							  "русич",
							  "викинг",
							  "степняк",
							  "агр.русичи",
							  "агр.викинги",
							  "агр.степняки",
							  "!оживить",
							  "\n",
							  "\n"
							};


const char *function_bits[] = { "!север",
								"!восток",
								"!юг",
								"!запад",
								"!вверх",
								"!вниз",
								"травит",
								"невидим",
								"подкрадывается",
								"маскируется",
								"*",
								"прилетает",
								"приползает",
								"прискакивает",
								"приплывает",
								"прибегает",
								"*",
								"*",
								"*",
								"*",
								"воздух",
								"вода",
								"земля",
								"огонь",
								"может быть нанят",
								"\n",
								"ворует",
								"вооружается",
								"одевается",
								"держит свет",
								"\n",
								"\n",
								"\n"
							  };



// PRF_x
const char *preference_bits[] = { "краткий",
								  "сжатый",
								  "!орать",
								  "!обратиться",
								  "п.жизни",
								  "п.запоминания",
								  "п.энергии",
								  "автовыходы",
								  "!напасть",
								  "призываем",
								  "КВЕСТ",
								  "!дублировать",
								  "всевидение",
								  "цвет 1",
								  "цвет 2",
								  "!иммканал",
								  "лог 1",
								  "лог 2",
								  "!аукцион",
								  "!болтать",
								  "себя в бою",
								  "флаги комнат",
								  "п.опыта",
								  "п.выходов",
								  "п.уровня",
								  "п.денег",
								  "п.тика",
								  "точный Стиль",
								  "осторожный Стиль",
								  "КОДЕР",
								  "\n",
								  "автозаучивание",
								  "!крики",
								  "IAC GA",
								  "полный состав группы",
								  "авто помощь",
								  "автограбеж",
								  "автодележ",
								  "брать куны",
								  "!арена",
								  "!базар",
								  "!клоны",
								  "!кто-то",
								  "мощная атака",
								  "улучшеная мощная атака",
								  "прицельная атака",
								  "улучшеная прицельная атака",
								  "новости",
								  "уведомления",
								  "хран.расс",
								  "хран.взял",
								  "реж.пкл",
								  "реж.политика",
								  "жел.ветер",
								  "пкл.формат",
								  "сокланы",
								  "оффтоп",
								  "потеря связи",
								  "без ингр.",
								  "не брать ингр.",
								  "кличи",
								  "\n",
								  "!оффтоп",
								  "ПАЛАЧ",
								  "реж.карта",
								  "может реморт",
								  "вход в зону",
								  "опечатки",
								  "сжатые маг.щиты",
								  "авто.не.призыв",
								  "\n"
								};



// AFF_x
const char *affected_bits[] = { "слепота",	// 0
								"невидимость",
								"определение наклонностей",
								"определение невидимости",
								"определение магии",
								"чувствовать жизнь",
								"хождение по воде",
								"освящение",
								"состоит в группе",
								"проклятие",
								"инфравидение",		// 10
								"яд",
								"защита от тьмы",
								"защита от света",
								"магический сон",
								"нельзя выследить",
								"привязан",
								"доблесть",
								"подкрадывается",
								"прячется",
								"ярость",		// 20
								"зачарован",
								"обездвижен",
								"летит",
								"молчание",
								"настороженность",
								"мигание",
								"верхом или под седлом",
								"не сбежит",
								"свет",
								"\n",
								"освещение",		// 0
								"затемнение",
								"определение яда",
								"под мухой",
								"отходняк",
								"декстраплегия",
								"синистроплегия",
								"параплегия",
								"кровотечение",
								"маскировка",
								"дышать водой",
								"торможение",
								"ускорение",
								"защита богов",
								"воздушный щит",
								"огненный щит",
								"ледяной щит",
								"зеркало магии",
								"звезды",
								"каменная рука",
								"призматическая.аура",
								"нанят",
								"силы зла",
								"воздушная аура",
								"огненная аура",
								"ледяная аура",
								"глухота",
								"плач",
								"смирение",
								"маг параплегия",
								"\n",
								"предсмертная ярость",
								"легкая поступь",
								"разбитые оковы",
								"облако стрел",
								"мантия теней",
								"блестящая пыль",
								"испуг",
								"яд скополии",
								"яд дурмана",
								"понижение умений",
								"не переключается",
								"яд белены",
								"прикован",
								"боевое везение",
								"перевязка",
								"не может перевязываться",
								"превращен",
								"удушье",
								"вспоминает заклинания",
								"регенерация новичка",
								"\n",
								"\n",
							  };

// AFF_ROOM_x
// Список описаний аффектов на комнатах которые видны - без DETECT_MAGIC
const char *room_aff_visib_bits[] =
{
	"&W... земля освещена колдовством ...&n",	// 0
	"&G... все окутано туманом ...&n", 		// AFF_FOG
	"",	// AFF_RUNE_LABEL
	"", // AFF_FORBIDDEN
	"\n",
	"\n",
	"\n"
};

// Список описаний аффектов на комнатах готорые видны - с DETECT_MAGIC
const char *room_aff_invis_bits[] =
{
	"&W... земля освещена колдовством ...&n",	// 0
	"&G... колдовской туман плывет над вами &n ...", // AFF_FOG
	"&G... светящиеся руны на земле складываются в чьё-то имя ...&n",	// AFF_RUNE_LABEL
	"&c... магическая печать закрывает все входы ...&n", // AFF_FORBIDDEN
	"\n",
	"\n",
	"\n",
};

// CON_x
const char *connected_types[] = { "В игре",
								  "Disconnecting",
								  "Get name",
								  "Confirm name",
								  "Get password",
								  "Get new PW",
								  "Confirm new PW",
								  "Select sex",
								  "Select class",
								  "Reading MOTD",
								  "Main Menu",
								  "Get descript.",
								  "Changing PW 1",
								  "Changing PW 2",
								  "Changing PW 3",
								  "Self-Delete 1",
								  "Self-Delete 2",
								  "Disconnecting",
								  "Object edit",
								  "Room edit",
								  "Zone edit",
								  "Mobile edit",
								  "Trigger edit",
								  "Get name2",
								  "Get name3",
								  "Get name4",
								  "Get name5",
								  "Get name6",
								  "Select religion",
								  "Select race",
								  "Select lows",
								  "Select keytable",
								  "Get email",
								  "Roll stats",
								  "Recept edit",
								  "Select kin",
								  "Select class vik",
								  "Select class step",
								  "map olc",
								  "Select color",
								  "Board message edit",
								  "House edit",
								  "Generate new name",
								  "Glory OLC",
								  "Base stats reroll",
								  "Select place of birth",
								  "Clan MoD edit",
								  "GloryConst OLC",
								  "NamedStuff OLC",
                                  "Select new kin",
                                  "Select new race",
								  "Interactive console",
								  "обмен гривен",
								  "меню сброса статов",
								  "sedit",
								  "\n"
								};


/*
 * WEAR_x - for eq list
 * Not use in sprinttype() so no \n.
 */
const char *where[] = { "<для освещения>             ",
						"<правый указательный палец> ",
						"<левый указательный палец>  ",
						"<на шее>                    ",
						"<на груди>                  ",
						"<на теле>                   ",
						"<на голове>                 ",
						"<на ногах>                  ",
						"<на ступнях>                ",
						"<на кистях>                 ",
						"<на руках>                  ",
						"<щит>                       ",
						"<на плечах>                 ",
						"<на поясе>                  ",
						"<на правом запястье>        ",
						"<на левом запястье>         ",
						"<в правой руке>             ",
						"<в левой руке>              ",
						"<в руках>                   "
					  };


// WEAR_x - for stat
const char *equipment_types[] = { "использует для освещения",
								  "надето на правый большой палец",
								  "надето на левый большой палец",
								  "намотано на шею",
								  "болтается на груди",
								  "надето на тело",
								  "надето на голову",
								  "надето на ноги",
								  "обут",
								  "на кистях",
								  "надето на руки",
								  "в качестве щита",
								  "наброшено на плечи",
								  "надето на пояс",
								  "на правом запястье",
								  "на левом запястье",
								  "сжимает в правой руке",
								  "держит в левой руке",
								  "держит в руках",
								  "\n"
								};


// ITEM_x (ordinal object types)
const char *item_types[] = { "UNDEFINED",
							 "СВЕТ",
							 "СВИТОК",
							 "ПАЛОЧКА",
							 "ПОСОХ",
							 "ОРУЖИЕ",
							 "ОГНЕВОЕ ОРУЖИЕ",
							 "РАКЕТА",
							 "ДРАГОЦЕННОСТЬ",
							 "БРОНЯ",
							 "НАПИТОК",
							 "ОДЕЖДА",
							 "ДРУГОЕ",
							 "TRASH",
							 "МУСОР",
							 "КОНТЕЙНЕР",
							 "БУМАГА",
							 "ЕМКОСТЬ",
							 "КЛЮЧ",
							 "ЕДА",
							 "ДЕНЬГИ",
							 "ПЕРО",
							 "ЛОДКА",
							 "ИСТОЧНИК",
							 "МАГИЧЕСКАЯ КНИГА",
							 "МАГИЧЕСКИЙ ИНГРЕДИЕНТ",
							 "МАГИЧЕСКИЙ КОМПОНЕНТ",
							 "МАТЕРИАЛ",
							 "БИНТ",
							 "ЛЕГКИЕ ДОСПЕХИ",
							 "СРЕДНИЕ ДОСПЕХИ",
							 "ТЯЖЕЛЫЕ ДОСПЕХИ",
							 "ЗАЧАРОВАНИЕ ПРЕДМЕТА",
							 "\n"
						   };

const char *ingradient_bits[] = { "руна",
								  "огр.применение",
								  "огр.повтор",
								  "огр.уровня",
								  "рассыпется",
								  "\n"
								};

// ITEM_WEAR_ (wear bitvector)
const char *wear_bits[] = { "ВЗЯТЬ",
							"ПАЛЬЦЫ",
							"ШЕЯ/ГРУДЬ",
							"ТЕЛО",
							"ГОЛОВА",
							"НОГИ",
							"СТУПНИ",
							"КИСТИ",
							"РУКИ",
							"ЩИТ",
							"ПЛЕЧИ",
							"ПОЯС",
							"ЗАПЯСТЬЕ",
							"ПРАВАЯ.РУКА",
							"ЛЕВАЯ.РУКА",
							"ОБЕ.РУКИ",
							"\n"
						  };


// ITEM_x (extra bits)
const char *extra_bits[] = { "светится",
							 "шумит",
							 "!рента",
							 "!пожертвовать",
							 "!невидим",
							 "невидим",
							 "магический",
							 "!бросить",
							 "благословлен",
							 "!продать",
							 "рассыпется",
							 "рассыпется вне зоны",
							 "!обезоружить",
							 "!рассыпется",
							 "отравлен",
							 "заточен",
							 "укреплен",
							 "появится днем",
							 "появится ночью",
							 "в полнолуние",
							 "появится зимой",
							 "появится весной",
							 "появится летом",
							 "появится осенью",
							 "плавает",
							 "летает",
							 "можно метнуть",
							 "таймер запущен",
							 "горит",
							 "рассыпется на репоп",
							 "\n",
							 "!разыскать",
							 "слабеет со временем",
							 "устойчив к магии",
							 "можно вплавить 1 камень",
							 "можно вплавить 2 камня",
							 "можно вплавить 3 камня",
							 "сетовый предмет",
							 "успех при изучении",
							 "именной предмет",
							 "окровавлен",
							 "*активация сета",
							 "* не используется - ITEM_2INLAID",
							 "* не используется - ITEM_3INLAID",
							 "\n",
							 "\n",
							 "\n"
						   };


// ITEM_NO_
const char *no_bits[] = { "!христиане",
						  "!язычники",
						  "!NEUTRAL",
						  "!маги",
						  "!лекари",
						  "!тати",
						  "!богатыри",
						  "!наемники",
						  "!дружинники",
						  "!витязи",
						  "!охотники",
						  "!кузнецы",
						  "!купцы",
						  "!волхвы",
						  "!колдуны",
						  "!кудесники",
						  "!волшебники",
						  "!чернокнижники",
						  "\n",
						  "!убийцы",
						  "!цветные",
						  "\n",
						  "!северяне",
						  "!поляне",
						  "!кривичи",
						  "!вятичи",
						  "!веляне",
						  "!древляне",
						  "!мужчины",
						  "!женщины",
						  "!чармисы",
						  "!половцы",
						  "!печенеги",
						  "!монголы",
						  "!уйгуры",
						  "!кангары",
						  "!хазары",
						  "!свеи",
						  "!датчане",
						  "!гетты",
						  "!ютты",
						  "!халейги",
						  "!норвежцы",
						  "\n",
						  "!русичи",
						  "!степняки",
						  "!викинги",
						  "\n",
						  "\n"
						};


// ITEM_ANTI
const char *anti_bits[] = { "!христиане",
							"!язычники",
							"!NEUTRAL",
							"!маги",
							"!лекари",
							"!тати",
							"!богатыри",
							"!наемники",
							"!дружинники",
							"!витязи",
							"!охотники",
							"!кузнецы",
							"!купцы",
							"!волхвы",
							"!колдуны",
							"!кудесники",
							"!волшебники",
							"!чернокнижники",
							"\n",
							"!убийцы",
							"!цветные",
							"\n",
							"!северяне",
							"!поляне",
							"!кривичи",
							"!вятичи",
							"!веляне",
							"!древляне",
							"!мужчины",
							"!женщины",
							"!чармисы",
							"!половцы",
							"!печенеги",
							"!монголы",
							"!уйгуры",
							"!кангары",
							"!хазары",
							"!свеи",
							"!датчане",
							"!гетты",
							"!ютты",
							"!халейги",
							"!норвежцы",
							"\n",
							"!русичи",
							"!степняки",
							"!викинги",
							"\n",
							"\n"
						  };

const char *apply_negative[] = { "защита",
								 "воля",		// SAVING_WILL
								 "здоровье",	// SAVING_CRITICAL
								 "стойкость",	// SAVING_STABILITY
								 "реакция",	// SAVING_REFLEX
								 "\n"
							   };


// APPLY_x
const char *apply_types[] = { "ничего",
							  "сила",
							  "ловкость",
							  "интеллект",
							  "мудрость",
							  "телосложение",
							  "обаяние",
							  "профессия",
							  "уровень",
							  "возраст",
							  "вес",
							  "рост",
							  "запоминание",
							  "макс.жизнь",
							  "макс.энергия",
							  "деньги",
							  "опыт",
							  "защита",
							  "попадание",
							  "повреждение",
							  "воля",
							  "защита.от.стихии.огня",
							  "защита.от.стихии.воздуха",
							  "здоровье",
							  "стойкость",
							  "восст.жизни",
							  "восст.энергии",
							  "слот.1",
							  "слот.2",
							  "слот.3",
							  "слот.4",
							  "слот.5",
							  "слот.6",
							  "слот.7",
							  "слот.8",
							  "слот.9",
							  "размер",
							  "броня",
							  "яд",
							  "реакция",
							  "успех.колдовства",
							  "удача",
							  "инициатива",
							  "религия(НЕ СТАВИТЬ)",
							  "поглощение",
							  "трудолюбие",
							  "защита.от.стихии.воды",
							  "защита.от.стихии.земли",
							  "живучесть",
							  "разум",
							  "иммунитет",
							  "защита.от.чар",
							  "защита.от.магических.повреждений",
							  "яд аконита",
							  "яд скополии",
							  "яд белены",
							  "яд дурмана",
							  "хп славой(НЕ СТАВИТЬ)",
							  "\n"
							};

// MAT_
const char *material_name[] = { "NO",
								"БУЛАТ",
								"БРОНЗА",
								"ЖЕЛЕЗО",
								"СТАЛЬ",
								"КОВАНАЯ.СТАЛЬ",
								"ДРАГ.МЕТАЛЛ",
								"КРИСТАЛЛ",
								"ДЕРЕВО",
								"ПРОЧНОЕ.ДЕРЕВО",
								"КЕРАМИКА",
								"СТЕКЛО",
								"КАМЕНЬ",
								"КОСТЬ",
								"ТКАНЬ",
								"КОЖА",
								"ОРГАНИКА",
								"БЕРЕСТА",
								"ДРАГ.КАМЕНЬ",
								"\n"
							  };

int material_value[] = { 100,
						 5,
						 50,
						 35,
						 30,
						 20,
						 35,
						 75,
						 45,
						 40,
						 65,
						 80,
						 55,
						 50,
						 70,
						 60,
						 90,
						 90,
						 10
					   };



// CONT_x
const char *container_bits[] = { "CLOSEABLE",
								 "PICKPROOF",
								 "CLOSED",
								 "LOCKED",
								 "\n",
							   };


/*
 * Уровень заполнения емкостей для питья и контейнеров для вещей
 * Not used in sprinttype() so no \n.
 */
const char *fullness[] =
{
	"меньше, чем на четверть ",
	"меньше, чем наполовину ",
	"примерно наполовину ",
	"больше, чем наполовину ",
	"почти полностью ",
	""
};


// str, int, wis, dex, con applies *************************************


// [ch] strength apply (all)
struct str_app_type str_app[] =
//  ToHit   ToDam CarryW   Wield Held
{
	{
		-5, -4, 0, 0, 0
	},		// str = 0
	{ -5, -4, 3, 1, 0},		// str = 1
	{ -3, -2, 3, 2, 1},
	{ -3, -1, 10, 3, 1},
	{ -2, -1, 25, 4, 2},
	{ -2, -1, 55, 5, 2},		// str = 5
	{ -1, 0, 80, 6, 3},
	{ -1, 0, 90, 7, 3},
	{0, 0, 100, 8, 4},
	{0, 0, 100, 9, 4},
	{0, 0, 115, 10, 5},		// str = 10
	{0, 0, 115, 11, 5},
	{0, 0, 140, 12, 6},
	{0, 0, 140, 13, 6},
	{0, 0, 170, 14, 7},
	{0, 0, 170, 15, 7},		// str = 15
	{0, 1, 195, 16, 8},
	{1, 1, 220, 17, 8},
	{1, 2, 255, 18, 9},		// str = 18
	{2, 7, 640, 19, 9},
	{3, 8, 700, 20, 10},		// str = 20
	{3, 9, 810, 20, 11},
	{4, 9, 970, 21, 11},
	{4, 10, 1130, 21, 12},
	{5, 10, 1440, 22, 12},
	{5, 11, 1500, 22, 13},		// str = 25
	{5, 11, 1550, 23, 13},
	{5, 12, 1600, 23, 14},
	{6, 12, 1650, 24, 14},
	{6, 13, 1700, 24, 15},
	{7, 13, 1750, 25, 15},		// str = 30
	{7, 13, 1800, 25, 15},
	{7, 14, 1820, 25, 15},
	{7, 14, 1840, 25, 16},
	{7, 14, 1860, 26, 16},
	{8, 14, 1880, 26, 16},		// str = 35
	{8, 14, 1900, 26, 17},
	{8, 15, 1920, 26, 17},
	{8, 15, 1940, 27, 17},
	{8, 15, 1960, 27, 17},
	{8, 15, 1980, 27, 18},		// str = 40
	{9, 16, 2000, 27, 18},
	{9, 16, 2020, 28, 18},
	{9, 16, 2040, 28, 18},
	{9, 16, 2060, 28, 19},
	{9, 17, 2080, 28, 19},		// str = 45
	{10, 17, 2090, 29, 19},
	{10, 17, 2100, 29, 19},
	{10, 17, 2130, 29, 19},
	{10, 18, 2150, 29, 20},
	{10, 18, 2200, 30, 20}		// str = 50
};



// [dex] skill apply (thieves only)
struct dex_skill_type dex_app_skill[] =
// P_poc P_lock   traps Sneak    Hide
{
	{
		-99, -99, -90, -99, -60
	},	// dex = 0
	{ -90, -90, -60, -90, -50},	// dex = 1
	{ -80, -80, -40, -80, -45},
	{ -70, -70, -30, -70, -40},
	{ -60, -60, -30, -60, -35},
	{ -50, -50, -20, -50, -30},	// dex = 5
	{ -40, -40, -20, -40, -25},
	{ -30, -30, -15, -30, -20},
	{ -20, -20, -15, -20, -15},
	{ -15, -10, -10, -20, -10},
	{ -10, -5, -10, -15, -7},	// dex = 10
	{ -5, -4, -5, -10, -5},
	{ -4, -2, -3, -5, -3},
	{ -2, 0, -1, -3, -1},
	{0, 2, 0, -1, 0},
	{2, 4, 1, 0, 2},		// dex = 15
	{3, 6, 2, 1, 3},
	{5, 8, 3, 3, 5},
	{10, 10, 4, 5, 7},		// dex = 18
	{15, 13, 5, 7, 9},
	{16, 15, 6, 8, 11},		// dex = 20
	{17, 20, 7, 10, 13},
	{18, 21, 8, 12, 15},
	{19, 22, 9, 14, 17},
	{20, 23, 10, 15, 19},
	{21, 24, 11, 16, 20},		// dex = 25
	{22, 25, 12, 18, 21},
	{23, 26, 13, 20, 22},
	{24, 27, 14, 22, 23},
	{24, 29, 15, 23, 24},
	{25, 30, 15, 25, 25},		// dex = 30
	{26, 32, 16, 25, 26},
	{27, 32, 16, 26, 27},
	{28, 33, 17, 27, 28},
	{29, 34, 17, 28, 29},
	{29, 35, 18, 28, 30},		// dex = 35
	{30, 36, 18, 29, 30},
	{30, 37, 19, 30, 31},
	{31, 38, 19, 31, 31},
	{31, 39, 20, 31, 32},
	{32, 40, 20, 32, 32},		// dex = 40
	{32, 41, 21, 33, 33},
	{33, 42, 21, 34, 33},
	{34, 43, 22, 35, 34},
	{35, 44, 22, 35, 34},
	{36, 45, 23, 36, 35},		// dex = 45
	{37, 46, 23, 37, 35},
	{38, 47, 24, 38, 36},
	{39, 48, 24, 38, 36},
	{40, 49, 25, 39, 38},
	{40, 50, 25, 40, 40}		// dex = 50
};


// [dex] apply (all)
struct dex_app_type dex_app[] =
// Rea MA  Def
{
	{
		-7, -7, 8
	},			// dex = 0
	{ -6, -6, 7},			// dex = 1
	{ -5, -4, 6},
	{ -4, -3, 4},
	{ -3, -2, 3},
	{ -2, -2, 2},			// dex = 5
	{ -2, -2, 2},
	{ -1, -1, 1},
	{ -1, -1, 1},
	{0, -1, 0},
	{0, 0, 0},			// dex = 10
	{0, 0, 0},
	{0, 0, 0},
	{1, 0, -1},
	{1, 1, -1},
	{1, 1, -1},			// dex = 15
	{1, 1, -2},
	{2, 2, -2},
	{2, 2, -2},			// dex = 18
	{2, 2, -3},
	{2, 2, -3},			// dex = 20
	{3, 3, -3},
	{3, 3, -4},
	{3, 3, -4},
	{3, 3, -4},
	{4, 3, -4},			// dex = 25
	{4, 4, -5},
	{4, 4, -5},
	{4, 4, -5},
	{4, 4, -5},
	{5, 5, -6},			// dex = 30
	{5, 5, -6},
	{5, 5, -6},
	{5, 5, -6},
	{5, 5, -6},
	{6, 5, -7},			// dex = 35
	{6, 6, -7},
	{6, 6, -7},
	{6, 6, -7},
	{6, 6, -7},
	{7, 6, -8},			// dex = 40
	{7, 6, -8},
	{7, 6, -8},
	{7, 7, -8},
	{7, 7, -8},
	{8, 7, -9},			// dex = 45
	{8, 7, -9},
	{8, 7, -9},
	{9, 8, -9},
	{9, 9, -9},
	{10, 10, -10}			// dex = 50
};



// [con] apply (all)
struct con_app_type con_app[] =
// Hitp Ress   AfSav    PsS CrS
{
	{
		-4, 100, 4, 5, 4
	},		// con = 0
	{ -3, 100, 4, 5, 4},		// con = 1
	{ -3, 90, 3, 5, 4},
	{ -3, 90, 3, 5, 3},
	{ -3, 80, 3, 4, 3},
	{ -3, 80, 2, 4, 3},		// con = 5
	{ -2, 80, 2, 3, 2},
	{ -2, 75, 2, 3, 2},
	{ -2, 75, 1, 2, 2},
	{ -2, 60, 1, 2, 1},
	{ -2, 60, 0, 1, 1},		// con = 10
	{ -1, 58, 0, 1, 1},
	{ -1, 56, 0, 1, 0},
	{ -1, 55, 0, 0, 0},
	{ -1, 53, 0, 0, 0},
	{1, 51, 0, 0, -1},		// con = 15
	{1, 50, -1, 0, -1},
	{1, 50, -1, -1, -1},
	{2, 50, -1, -1, -2},		// con = 18
	{2, 48, -1, -2, -2},
	{3, 47, -2, -2, -2},		// con = 20
	{3, 47, -2, -3, -3},
	{3, 47, -2, -3, -3},
	{3, 46, -2, -4, -3},
	{4, 46, -3, -4, -3},
	{4, 45, -3, -5, -4},		// con = 25
	{4, 45, -3, -5, -4},
	{4, 44, -4, -6, -4},
	{5, 44, -4, -7, -4},
	{5, 43, -4, -7, -5},
	{5, 43, -5, -8, -5},		// con = 30
	{5, 42, -6, -8, -5},
	{5, 42, -7, -8, -5},
	{5, 41, -8, -8, -5},
	{5, 41, -9, -9, -6},
	{5, 40, -10, -9, -6},		// con = 35
	{5, 39, -10, -9, -6},
	{5, 39, -10, -10, -6},
	{5, 38, -10, -10, -7},
	{5, 38, -10, -11, -7},
	{6, 37, -11, -11, -7},		// con = 40
	{6, 37, -11, -12, -7},
	{6, 36, -11, -12, -8},
	{6, 36, -11, -12, -8},
	{6, 35, -11, -13, -8},
	{6, 35, -12, -13, -8},		// con = 45
	{6, 34, -13, -14, -9},
	{6, 33, -13, -14, -9},
	{6, 32, -14, -14, -9},
	{6, 31, -14, -15, -9},
	{6, 30, -15, -15, -10}		// con = 50
};


struct int_app_type int_app[] =
{
//Ackn  SkUse  SpLv     SpCnt Impr Obser
	{10, -10, 10, 0, 2, -5},	// int = 0
	{10, -10, 10, 0, 2, -5},	// int = 1
	{10, -9, 10, 0, 2, -5},
	{14, -9, 10, 0, 2, -4},
	{18, -9, 15, 0, 2, -4},
	{22, -8, 20, 0, 3, -3},	// int = 5
	{26, -8, 25, 0, 3, -2},
	{30, -7, 30, 0, 3, -2},
	{34, -7, 40, 0, 3, -1},
	{38, -6, 50, 0, 3, -1},
	{42, -6, 60, 0, 4, 0},	// int = 10
	{46, -5, 63, 0, 4, 0},
	{50, -5, 66, 0, 4, 0},
	{53, -4, 69, 0, 4, 0},
	{57, -3, 72, 0, 5, 0},
	{60, -2, 75, 0, 5, 1},	// int = 15
	{64, -1, 78, 0, 6, 1},
	{68, 0, 81, 0, 6, 2},
	{72, 0, 84, 0, 7, 2},	// int = 18
	{76, 1, 87, 0, 7, 3},
	{80, 1, 90, 0, 8, 3},	// int = 20
	{82, 2, 92, 0, 8, 3},
	{84, 3, 94, 0, 8, 4},
	{86, 3, 96, 0, 8, 4},
	{88, 4, 98, 0, 8, 4},
	{90, 5, 100, 0, 9, 5},	// int = 25
	{91, 6, 105, 0, 9, 5},
	{92, 6, 110, 0, 9, 5},
	{93, 6, 115, 0, 9, 6},
	{94, 7, 120, 0, 9, 6},
	{95, 7, 130, 0, 10, 7},	// int = 30
	{95, 7, 135, 0, 10, 7},
	{95, 8, 140, 0, 10, 7},
	{95, 8, 145, 0, 10, 7},
	{95, 8, 150, 0, 10, 7},
	{96, 9, 150, 0, 11, 8},	// int = 35
	{96, 9, 155, 0, 11, 8},
	{96, 9, 155, 0, 11, 8},
	{96, 9, 160, 0, 11, 8},
	{96, 10, 160, 0, 11, 8},
	{97, 10, 165, 0, 12, 9},	// int = 40
	{97, 10, 165, 0, 12, 9},
	{97, 10, 170, 0, 12, 9},
	{97, 11, 170, 0, 12, 9},
	{97, 11, 175, 0, 13, 9},
	{98, 11, 175, 0, 13, 10},	// int = 45
	{98, 12, 180, 0, 13, 11},
	{98, 12, 180, 0, 14, 12},
	{99, 12, 190, 0, 14, 13},
	{99, 12, 190, 0, 14, 14},
	{100, 12, 200, 0, 15, 15}	// int = 50
};

#define s0 (0)
#define s1 (1 << 0)
#define s2 (1 << 1)
#define s3 (1 << 2)
#define s4 (1 << 3)
#define s5 (1 << 4)
#define s6 (1 << 5)
#define s7 (1 << 6)

// [wis] apply (all)
struct wis_app_type wis_app[] =
{
//SpAd                 M20  SpScss ChSav   MxSk
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 0, 30, 3, 1},	// wis = 0
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 20, 34, 3, 1},	// wis = 1
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 24, 38, 3, 2},
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 28, 42, 3, 3},
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 32, 46, 3, 4},
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 36, 50, 2, 5},	// wis = 5
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 40, 52, 2, 6},
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 45, 54, 2, 7},
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 50, 56, 1, 8},
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 55, 58, 1, 9},
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 60, 60, 1, 10},	// wis = 10
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 62, 64, 0, 11},
	{s0 | s0 | s0 | s0 | s0 | s0 | s0, 64, 68, 0, 12},
	{s1 | s0 | s0 | s0 | s0 | s0 | s0, 66, 72, 0, 13},
	{s1 | s0 | s0 | s0 | s0 | s0 | s0, 68, 76, 0, 14},
	{s0 | s2 | s0 | s0 | s0 | s0 | s0, 70, 80, 0, 15},	// wis = 15
	{s0 | s2 | s0 | s0 | s0 | s0 | s0, 72, 82, -1, 15},
	{s0 | s0 | s3 | s0 | s0 | s0 | s0, 74, 84, -1, 16},
	{s0 | s0 | s0 | s4 | s0 | s0 | s0, 76, 86, -1, 16},	// wis = 18
	{s1 | s0 | s3 | s0 | s0 | s0 | s0, 78, 88, -2, 17},
	{s0 | s2 | s0 | s4 | s0 | s0 | s0, 80, 90, -2, 17},	// wis = 20
	{s0 | s0 | s3 | s0 | s5 | s0 | s0, 82, 91, -2, 18},
	{s0 | s0 | s0 | s4 | s5 | s0 | s0, 84, 92, -3, 18},
	{s1 | s0 | s0 | s0 | s0 | s6 | s0, 96, 93, -3, 19},
	{s0 | s0 | s0 | s0 | s5 | s6 | s0, 88, 94, -3, 19},
	{s0 | s0 | s0 | s0 | s0 | s6 | s7, 90, 95, -4, 20},	// wis = 25
	{s0 | s0 | s0 | s4 | s0 | s0 | s0, 92, 96, -6, 21},
	{s0 | s0 | s0 | s0 | s0 | s6 | s0, 94, 97, -7, 22},
	{s0 | s2 | s0 | s0 | s0 | s0 | s0, 96, 98, -8, 23},
	{s0 | s0 | s3 | s0 | s0 | s0 | s0, 98, 99, -9, 24},
	{s0 | s0 | s0 | s0 | s5 | s0 | s0, 100, 100, -10, 25},	// wis = 30
	{s1 | s0 | s0 | s0 | s0 | s0 | s0, 100, 101, -11, 25},
	{s0 | s0 | s0 | s0 | s0 | s0 | s7, 100, 102, -12, 26},
	{s0 | s0 | s0 | s4 | s0 | s0 | s0, 100, 103, -13, 26},
	{s0 | s2 | s0 | s0 | s0 | s0 | s0, 100, 104, -14, 27},
	{s0 | s0 | s0 | s0 | s0 | s6 | s0, 100, 105, -15, 27},	// wis = 35
	{s1 | s0 | s0 | s0 | s0 | s0 | s0, 100, 106, -15, 28},
	{s0 | s0 | s3 | s0 | s0 | s0 | s0, 100, 107, -16, 28},
	{s0 | s0 | s0 | s0 | s5 | s0 | s0, 100, 108, -16, 29},
	{s0 | s0 | s0 | s0 | s0 | s0 | s7, 100, 109, -17, 29},
	{s0 | s0 | s0 | s4 | s0 | s0 | s0, 100, 110, -17, 30},	// wis = 40
	{s1 | s0 | s0 | s0 | s0 | s0 | s0, 100, 111, -18, 30},
	{s0 | s2 | s0 | s0 | s0 | s0 | s0, 100, 112, -18, 31},
	{s0 | s0 | s0 | s0 | s0 | s6 | s0, 100, 113, -19, 31},
	{s0 | s0 | s3 | s0 | s0 | s0 | s0, 100, 114, -19, 32},
	{s0 | s0 | s0 | s0 | s5 | s0 | s0, 100, 115, -20, 32},	// wis = 45
	{s0 | s0 | s0 | s0 | s0 | s0 | s7, 100, 116, -21, 33},
	{s0 | s2 | s0 | s0 | s0 | s0 | s0, 100, 117, -22, 33},
	{s1 | s0 | s0 | s0 | s0 | s0 | s0, 100, 118, -23, 34},
	{s0 | s0 | s0 | s4 | s0 | s0 | s0, 100, 119, -24, 34},
	{s0 | s0 | s0 | s0 | s0 | s6 | s0, 100, 120, -25, 35}	// wis = 50
};

struct size_app_type size_app[] =
{
// AC  BASH
	{ -2, -10, 5, 1},	// size = 0
	{ -2, -10, 5, 1},	// size = 2
	{ -2, -10, 5, 1},
	{ -2, -9, 4, 1},
	{ -2, -9, 4, 2},
	{ -2, -8, 4, 2},		// size = 10
	{ -2, -8, 4, 2},
	{ -2, -7, 4, 2},
	{ -2, -7, 3, 2},
	{ -2, -7, 3, 3},
	{ -2, -6, 3, 3},		// size = 20
	{ -1, -6, 3, 3},
	{ -1, -6, 3, 3},
	{ -1, -5, 2, 4},
	{ -1, -5, 2, 4},
	{ -1, -4, 2, 4},		// size = 30
	{ -1, -4, 2, 4},
	{ -1, -4, 2, 5},
	{ -1, -3, 1, 5},
	{ -1, -3, 1, 6},
	{ -1, -2, 1, 6},		// size = 40
	{0, -2, 1, 7},
	{0, -1, 1, 7},
	{0, -1, 0, 8},
	{0, 0, 0, 9},
	{0, 0, 0, 9},		// size = 50
	{0, 0, 0, 10},
	{0, 1, 0, 11},
	{0, 1, -1, 11},
	{0, 1, -1, 12},
	{0, 2, -1, 12},		// size = 60
	{1, 2, -1, 13},
	{1, 2, -1, 13},
	{1, 3, -2, 14},
	{1, 3, -2, 14},
	{1, 4, -2, 15},		// size = 70
	{2, 4, -2, 16},
	{2, 5, -2, 17},
	{2, 5, -3, 18},
	{2, 5, -3, 19},
	{3, 6, -3, 20},		// size = 80
	{3, 6, -3, 21},
	{3, 7, -3, 22},
	{3, 7, -4, 23},
	{3, 7, -4, 24},
	{4, 8, -4, 25},		// size = 90
	{4, 8, -4, 26},
	{4, 9, -4, 27},
	{5, 9, -5, 28},
	{5, 10, -5, 29},
	{5, 10, -5, 30}		// size = 100
};

struct cha_app_type cha_app[] =
{
// Lead Chrm Mr Illu Dam_to_hit_rate
	{ -6, 50, 0, -6, 20},	// size = 0
	{ -6, 70, 0, -6, 20},	// size = 1
	{ -6, 90, 0, -6, 20},
	{ -6, 100, 0, -5, 20},
	{ -5, 120, 0, -5, 20},
	{ -4, 140, 0, -4, 20},	// size = 5
	{ -3, 160, 0, -4, 20},
	{ -2, 180, 0, -4, 20},
	{ -1, 200, 0, -3, 20},
	{0, 220, 0, -3, 20},
	{0, 260, 0, -2, 20},	// size = 10
	{1, 300, 0, -2, 20},
	{2, 340, 0, -1, 20},
	{3, 380, 0, -1, 20},
	{4, 420, 0, 0, 20},
	{5, 460, 0, 0, 20},	// size = 15
	{5, 500, 0, 1, 20},
	{6, 550, 0, 3, 20},
	{6, 600, 0, 5, 20},
	{7, 650, 0, 7, 20},
	{7, 700, 0, 9, 20},	// size = 20
	{8, 800, 0, 11, 20},
	{8, 840, 0, 12, 20},
	{9, 880, 0, 13, 20},
	{9, 920, 0, 14, 20},
	{10, 960, 0, 15, 20},	// size = 25
	{11, 1000, 0, 16, 20},
	{12, 1200, 0, 17, 20},
	{13, 1400, 0, 18, 20},
	{14, 1600, 0, 19, 20},
	{15, 1800, 0, 20, 20},	// size = 30
	{16, 2000, 0, 21, 20},
	{17, 2100, 0, 22, 20},
	{18, 2200, 0, 23, 20},
	{19, 2300, 0, 24, 20},
	{20, 2400, 0, 25, 20},	// size = 35
	{21, 2500, 0, 26, 20},
	{22, 2600, 0, 27, 20},
	{23, 2700, 0, 28, 20},
	{24, 2800, 0, 29, 20},
	{25, 2900, 0, 30, 20},	// size = 40
	{26, 3000, 0, 31, 20},
	{27, 3100, 0, 32, 20},
	{28, 3200, 0, 33, 20},
	{29, 3300, 0, 34, 20},
	{30, 3400, 0, 35, 20},	// size = 45
	{32, 3500, 0, 36, 20},
	{34, 3600, 0, 37, 20},
	{36, 3700, 0, 38, 20},
	{38, 3900, 0, 39, 20},
	{48, 4000, 0, 40, 20}	// size = 50
};


struct weapon_app_type weapon_app[] =
{
// Sho   Bash  Parrying
	{1, -5, -10},		// ww = 0
	{1, -4, -10},		// ww = 1
	{1, -3, -8},
	{2, -2, -6},
	{2, -1, -4},
	{3, 0, -2},		// ww = 5
	{3, 1, 0},
	{4, 2, 2},
	{4, 3, 4},
	{5, 4, 6},
	{5, 5, 8},		// ww = 10
	{5, 6, 10},
	{6, 7, 11},
	{6, 8, 12},
	{7, 9, 13},
	{7, 10, 15},		// ww = 15
	{8, 12, 16},
	{8, 14, 17},
	{9, 16, 18},		// ww = 18
	{9, 18, 19},
	{10, 20, 20},		// ww = 20
	{11, 21, 21},
	{12, 22, 22},
	{13, 23, 23},
	{14, 24, 24},
	{15, 25, 25},		// ww = 25
	{16, 26, 26},
	{17, 27, 27},
	{18, 28, 28},
	{19, 29, 29},
	{20, 30, 30},		// ww = 30
	{22, 31, 31},
	{24, 32, 32},
	{26, 33, 33},
	{28, 34, 34},
	{30, 35, 35},		// ww = 35
	{32, 36, 36},
	{34, 37, 37},
	{36, 38, 38},
	{38, 39, 39},
	{40, 40, 40},		// ww = 40
	{41, 41, 41},
	{42, 42, 42},
	{43, 43, 43},
	{44, 44, 44},
	{45, 45, 45},		// ww = 45
	{46, 46, 46},
	{47, 47, 47},
	{48, 48, 48},
	{49, 49, 49},
	{50, 50, 50}		// ww = 50
};

struct extra_affects_type ClericAffects[] = { { -1, -1} };
struct extra_affects_type MageAffects[] = { {AFF_INFRAVISION, 1},
	{ -1, -1}
};
struct extra_affects_type ThiefAffects[] = { {AFF_INFRAVISION, 1},
	{AFF_SENSE_LIFE, 1},
	{AFF_BLINK, 1},
	{ -1, -1}
};
struct extra_affects_type WarriorAffects[] = { { -1, -1} };
struct extra_affects_type AssasineAffects[] = { {AFF_INFRAVISION, 1},
	{ -1, -1}
};
struct extra_affects_type GuardAffects[] = { { -1, -1} };
struct extra_affects_type DefenderAffects[] = { { -1, -1} };
struct extra_affects_type CharmerAffects[] = { { -1, -1} };
struct extra_affects_type NecromancerAffects[] = { {AFF_INFRAVISION, 1},
	{ -1, -1}
};
struct extra_affects_type PaladineAffects[] = { { -1, -1} };
struct extra_affects_type RangerAffects[] = { {AFF_INFRAVISION, 1},
	{AFF_SENSE_LIFE, 1},
	{ -1, -1}
};
struct extra_affects_type SmithAffects[] = { { -1, -1} };
struct extra_affects_type MerchantAffects[] = { { -1, -1} };
struct extra_affects_type DruidAffects[] = { { -1, -1} };

struct class_app_type class_app[NUM_CLASSES] =
{
// unknown_weapon_fault koef_con base_con min_con max_con extra_affects
	{5,  40, 10, 12, 50, (struct extra_affects_type *) &ClericAffects},
	{3,  35, 10, 10, 50, (struct extra_affects_type *) &MageAffects},
	{3,  55, 10, 14, 50, (struct extra_affects_type *) &ThiefAffects},
	{2, 105, 10, 22, 50, (struct extra_affects_type *) &WarriorAffects},
	{3,  50, 10, 14, 50, (struct extra_affects_type *) &AssasineAffects},
	{2, 105, 10, 17, 50, (struct extra_affects_type *) &GuardAffects},
	{5,  35, 10, 10, 50, (struct extra_affects_type *) &DefenderAffects},
	{5,  35, 10, 10, 50, (struct extra_affects_type *) &CharmerAffects},
	{5,  35, 10, 11, 50, (struct extra_affects_type *) &NecromancerAffects},
	{2, 100, 10, 14, 50, (struct extra_affects_type *) &PaladineAffects},
	{2, 100, 10, 14, 50, (struct extra_affects_type *) &RangerAffects},
	{2, 100, 10, 14, 50, (struct extra_affects_type *) &SmithAffects},
	{3,  50, 10, 14, 50, (struct extra_affects_type *) &MerchantAffects},
	{5,  40, 10, 12, 50, (struct extra_affects_type *) &DruidAffects}
};

const char *spell_wear_off_msg[LAST_USED_SPELL + 1] = { "RESERVED DB.C",	// 0
		"Вы почувствовали себя менее защищенно.",	// 1
		"!Teleport!",
		"Вы почувствовали себя менее доблестно.",
		"Вы вновь можете видеть.",
		"!Burning Hands!",	// 5
		"!Call Lightning",
		"Вы подчиняетесь теперь только себе.",
		"Вы отметили, что силы вернулись к вам.",
		"!Clone!",
		"!Color Spray!",	// 10
		"!Control Weather!",
		"!Create Food!",
		"!Create Water!",
		"!Cure Blind!",
		"!Cure Critic!",	// 15
		"!Cure Light!",
		"Вы почувствовали себя более уверенно.",
		"Вы более не можете определять наклонности.",
		"Вы не в состоянии больше видеть невидимых.",
		"Вы не в состоянии более определять магию.",	// 20
		"Вы не в состоянии более определять яды.",
		"!Dispel Evil!",
		"!Earthquake!",
		"!Enchant Weapon!",
		"!Energy Drain!",	// 25
		"!Fireball!",
		"!Harm!",
		"!Heal!",
		"Вы вновь видимы.",
		"!Lightning Bolt!",	// 30
		"!Locate object!",
		"!Magic Missile!",
		"В вашей крови не осталось ни капельки яда.",
		"Вы вновь ощущаете страх перед тьмой.",
		"!Remove Curse!",	// 35
		"Белая аура вокруг вашего тела угасла.",
		"!Shocking Grasp!",
		"Вы не чувствуете сонливости.",
		"Вы чувствуете себя немного слабее.",
		"!Summon!",		// 40
		"Вы утратили покровительство высших сил.",
		"!Word of Recall!",
		"!Remove Poison!",
		"Вы больше не можете чувствовать жизнь.",
		"!Animate Dead!",	// 45
		"!Dispel Good!",
		"!Group Armor!",
		"!Group Heal!",
		"!Group Recall!",
		"Вы больше не можете видеть ночью.",	// 50
		"Вы больше не можете ходить по воде.",
		"!SPELL CURE SERIOUS!",
		"!SPELL GROUP STRENGTH!",
		"К вам вернулась способность двигаться.",
		"!SPELL POWER HOLD!",	// 55
		"!SPELL MASS HOLD!",
		"Вы приземлились на землю.",
		"Вы вновь стали уязвимы для оцепенения.",
		"Вы опять можете сбежать с поля боя.",
		"!SPELL CREATE LIGHT!",	// 60
		"Облако тьмы, окружающее вас, спало.",
		"Ваша кожа вновь стала мягкой и бархатистой.",
		"Ваши очертания приобрели отчетливость.",
		"Теперь вы можете болтать, все что думаете.",
		"Ваше тело перестало светиться.",	// 65
		"!SPELL CHAIN LIGHTNING!",
		"!SPELL FIREBLAST!",
		"!SPELL IMPLOSION!",
		"Силы вернулись к вам.",
		"!SPELL GROUP INVISIBLE!",	// 70
		"Ваша теневая мантия замерцала и растаяла.",
		"!SPELL ACID!",
		"!SPELL REPAIR!",
		"Ваши размеры стали прежними.",
		"!SPELL FEAR!",		// 75
		"!SPELL SACRIFICE!",
		"Магическая сеть, покрывавшая вас, исчезла.",
		"Вы перестали мигать.",
		"!SPELL REMOVE HOLD!",
		"Вы стали вновь похожи сами на себя.",	// 80
		"!SPELL POWER BLINDNESS!",
		"!SPELL MASS BLINDNESS!",
		"!SPELL POWER SIELENCE!",
		"!SPELL EXTRA HITS!",
		"!SPELL RESSURECTION!",	// 85
		"Ваш волшебный щит рассеялся.",
		"Магия, запечатывающая входы, пропала.",
		"!SPELL MASS SIELENCE!",
		"!SPELL REMOVE SIELENCE!",
		"!SPELL DAMAGE LIGHT!",	// 90
		"!SPELL DAMAGE SERIOUS!",
		"!SPELL DAMAGE CRITIC!",
		"!SPELL MASS CURSE!",
		"!SPELL ARMAGEDDON!",
		"!SPELL GROUP FLY!",	// 95
		"!SPELL GROUP BLESS!",
		"!SPELL REFRESH!",
		"!SPELL STUNNING!",
		"Вы стали заметны окружающим.",
		"Ваши передвижения стали заметны.",	// 100
		"Кураж прошел. Мама, лучше бы я умер$q вчера.",
		"А головка ваша уже не болит.",
		"!SPELL FULL!",
		"Вы согрелись и подвижность вернулась к вам.",
		"К вам вернулась способность нормально сражаться.",	// 105
		"Ваши кровоточащие раны затянулись.",
		"Вы успокоились.",
		"Вы более неспособны дышать водой.",
		"Медлительность исчезла.",
		"Вы стали более медлительны.",	// 110
		"!SPELL MASS SLOW!",
		"!SPELL MASS HASTE!",
		"Голубой кокон вокруг вашего тела угас.",
		"Лихорадка прекратилась.",
		"!SPELL CURE PLAQUE!",	// 115
		"Вы стали менее внимательны.",
		"Вы утратили расположение Богов.",
		"Ваш воздушный щит исчез.",
		"!PORTAL!",
		"!DISPELL MAGIC!",	// 120
		"!SUMMON KEEPER!",
		"Живительная сила покинула вас.",
		"!CREATE WEAPON!",
		"Огненный щит вокруг вашего тела исчез.",
		"!RELOCATE!",		// 125
		"!SUMMON FIREKEEPER!",
		"Ледяной щит вокруг вашего тела исчез.",
		"Ваши мышцы оттаяли и вы снова можете двигаться.",
		"Ваши размеры вновь стали прежними.",
		"!SHINE LIGHT!",	// 130
		"Безумие боя отпустило вас.",
		"!GROUP MAGICGLASS!",
		"Облако стрел вокруг вас рассеялось.",
		"!VACUUM!",
		"!METEOR STORM!",	// 135
		"Ваши руки вернулись к прежнему состоянию.",
		"Ваш разум просветлел.",
		"Призматическая аура вокруг вашего тела угасла.",
		"Силы зла оставили вас.",
		"Воздушная аура вокруг вас исчезла.",	// 140
		"Огненная аура вокруг вас исчезла.",
		"Ледяная аура вокруг вас исчезла.",
		"!SHOCK!",
		"Вы вновь чувствительны к магическим поражениям.",
		"!SPELL GROUP SANCTUARY!",	// 145
		"!SPELL GROUP PRISMATICAURA!",
		"Вы вновь можете слышать.",
		"!SPELL_POWER_DEAFNESS!",
		"!SPELL_REMOVE_DEAFNESS!",
		"!SPELL_MASS_DEAFNESS!",	// 150
		"!SPELL_DUSTSTORM!",
		"!SPELL_EARTHFALL!",
		"!SPELL_SONICWAVE!",
		"!SPELL_HOLYSTRIKE!",
		"!SPELL_SPELL_ANGEL!",                 // 155
		"!SPELL_SPELL_MASS_FEAR!",
		"Ваша красота куда-то пропала.",
		"Ваша душа успокоилась.",
		"!SPELL_OBLIVION!",
		"!SPELL_BURDEN_OF_TIME!",        // 160
		"!SPELL_GROUP_REFRESH!",
		"Смирение в вашей душе вдруг куда-то исчезло.",
		"К вам вернулась способность нормально сражаться.",
		"Неистовство оставило вас.",
		"!stone bones!",               // 165
		"Колдовской свет угас.",          // SPELL_ROOM_LIGHT - строка при снятии аффекта
		"Порыв ветра развеял ядовитый туман.",   // SPELL_POISONED_FOG - строка при снятии аффекта
		"Ветер прогнал грозовые тучи.",		 // SPELL_THUNDERSTORM - строка при снятии аффекта
		"Ваши следы вновь стали заметны.",
		"Удача вновь вернулась к вам.",		// 170
		"Магические чары ослабели со временем и покинули вас.",
		"Покрывавшая вас блестящая пыль осыпалась и растаяла в воздухе.", // SPELL_GLITTERDUST
		"Леденящий душу испуг отпустил вас.",
		"Ваши движения утратили прежнюю колдовскую ловкость.",
		"Ваше телосложение вновь стало обычным.",
		"Вы утратили навеянную магией мудрость.",
		"Навеянная магией хитрость покинула вас.",
		"!SPELL_WC_OF_CHALLENGE!",
		"",		// SPELL_WC_OF_MENACE
		"!SPELL_WC_OF_RAGE!",
		"",		// SPELL_WC_OF_MADNESS
		"!SPELL_WC_OF_THUNDER!",
		"!SPELL_WC_OF_FEAR!",
		"Действие клича битвы закончилось.",		// SPELL_WC_OF_BATTLE
		"Действие клича мощи закончилось.",		// SPELL_WC_OF_POWER
		"Действие клича доблести закончилось.",		// SPELL_WC_OF_BLESS
		"Действие клича отваги закончилось.",		// SPELL_WC_OF_COURAGE
		"Магические письмена на земле угасли.",         // SPELL_RUNE_LABEL
		"В вашей крови не осталось ни капельки яда.", // SPELL_ACONITUM_POISON
		"В вашей крови не осталось ни капельки яда.", // SPELL_SCOPOLIA_POISON
		"В вашей крови не осталось ни капельки яда.", // SPELL_BELENA_POISON
		"В вашей крови не осталось ни капельки яда.",  // SPELL_DATURA_POISON
		"SPELL_TIMER_REPAIR",
		"!SPELL_LACKY!",
		"Вы аккуратно перевязали свои раны.",
		"Вы снова можете перевязывать свои раны.",
		"!SPELL_CAPABLE!",
		"Удушье отпустило вас, и вы вздохнули полной грудью.", //SPELL_STRANGLE
		"Вам стало не на чем концентрироваться." //SPELL_RECALL_SPELLS
};



const char *cast_phrase[LAST_USED_SPELL + 1][2] = { {"\nRESERVED DB.C",	// 0
		"\n"},
	{"буде во прибежище",		// 1
	 "... Он - помощь наша и защита наша."},
	{"несите ветры",
	 "... дух поднял меня и перенес меня."},
	{"истягну умь крепостию",
	 "... даст блага просящим у Него."},
	{"Чтоб твои зенки вылезли!",
	 "... поразит тебя Господь слепотою."},
	{"узри огонь!",			// 5
	 "... простер руку свою к огню."},
	{"Разрази тебя Перун!",
	 "... и путь для громоносной молнии."},
	{"умь полонить",
	 "... слушай пастыря сваего, и уразумей."},
	{"хладну персты воскладаше",
	 "... которые черны от льда."},
	{"пусть будет много меня",
	 "... и плодились, и весьма умножились."},
	{"варно сожжет струя",		// 10
	 "... бросает огонь, стрелы и смерть."},
	{"стихия подкоряшися",
	 "... власть затворить небо, чтобы не шел дождь."},
	{"будовати снедь",
	 "... это хлеб, который Господь дал вам в пищу."},
	{"напоиши влагой",
	 "... и потекло много воды."},
	{"зряще узрите",
	 "... и прозрят из тьмы и мрака глаза слепых."},
	{"гой еси",			// 15
	 "... да зарубцуются гноища твои."	//
	},
	{"малейше целити раны",
	 "... да затянутся раны твои."	//
	},
	{"порча",
	 "... проклят ты пред всеми скотами."},
	{"узряще норов",
	 "... и отделит одних от других, как пастырь отделяет овец от козлов."},
	{"взор мечетный",
	 "... ибо нет ничего тайного, что не сделалось бы явным."},
	{"зряще ворожбу",		// 20
	 "... покажись, ересь богопротивная."	//
	},
	{"зряще трутизну",
	 "... по плодам их узнаете их."},
	{"долой нощи",
	 "... грешников преследует зло, а праведникам воздается добром."},
	{
		"земля тутнет",
		"... в тот же час произошло великое землетрясение."},
	{"ницовати стружие",
	 "... укрепи сталь Божьим перстом."	//
	},
	{"преторгоста",			// 25
	 "... да иссякнут соки, питающие тело."	//
	},
	{"огненну солнце",
	 "... да ниспадет огонь с неба, и пожрет их."	//
	},
	{"згола скверна",
	 "... и жестокою болью во всех костях твоих."},
	{"згола гой еси",
	 "... тебе говорю, встань."},
	{"низовати мечетно",
	 "... ибо видимое временно, а невидимое вечно."},
	{"грянет гром",			// 30
	 "... и были громы и молнии."},
	{"рища, летая умом под облакы",
	 "... ибо всякий просящий получает, и ищущий находит."},
	{"ворожья стрела",
	 "... остры стрелы Твои."},
	{"трутизна",
	 "... и пошлю на них зубы зверей и яд ползающих по земле."},
	{"супостат нощи",
	 "... свет, который в тебе, да убоится тьма."	//
	},
	{"изыде порча",			// 35
	 "... да простятся тебе прегрешения твои."	//
	},
	{"иже во святых",
	 "... буде святым, аки Господь наш свят."	//
	},
	{"воскладше огненну персты",
	 "... и дано буде жечь врагов огнем."	//
	},
	{"иже дремлет",
	 "... на веки твои тяжесть покладет."	//
	},
	{"будет силен",
	 "... и человек разумный укрепляет силу свою."},
	{"кличу-велю",			// 40
	 "... и послали за ним и призвали его."},
	{"ибо будет угоден Богам",
	 "... ибо спасет людей Своих от грехов их."},
	{"с глаз долой исчезни",
	 "... ступай с миром."		//
	},
	{"изыде трутизна",
	 "... именем Божьим, изгнати сгниенье из тела."	//
	},
	{"зряще живота",
	 "... ибо нет ничего сокровенного, что не обнаружилось бы."	//
	},
	{"живот изо праха створисте",	// 45
	 "... и земля извергнет мертвецов."},
	{"свет сгинь",
	 "... и тьма свет накроет."	//
	},
	{"прибежище други",
	 "... ибо кто Бог, кроме Господа, и кто защита, кроме Бога нашего?"},
	{"други, гой еси",
	 "... вам говорю, встаньте."},
	{"исчезните с глаз моих",
	 "... вам говорю, ступайте с миром."	//
	},
	{"в нощи зряще",		// 50 - INFRAVISION
	 "...ибо ни днем, ни ночью сна не знают очи."},
	{"по воде аки по суху",
	 "... поднимись и ввергнись в море."	//
	},
	{"целите раны",
	 "... да уменьшатся раны твои."	//
	},
	{"други сильны",
	 "... и даст нам Господь силу."},
	{"аки околел",
	 "... замри."			//
	},
	{"згола аки околел",		// 55
	 "... замри надолго."		//
	},
	{"их окалеть",
	 "... замрите."			//
	},
	{"летать зегзицею",
	 "... и полетел, и понесся на крыльях ветра."},
	{"вериги и цепи железные изорву",
	 "... и цепи упали с рук его."},
	{"опуташа в путины железны",
	 "... да поищешь уйти, да не возможешь."	//
	},
	{"будовати светоч",		// 60
	 "... да будет свет."},
	{"тьмою прикрыты",
	 "... тьма покроет землю."},
	{"буде тверд аки камень",
	 "... твердость ли камней твердость твоя?"},
	{"мгла покрыла",
	 "... будут как утренний туман."},
	{"типун тебе на язык!",
	 "... да замкнутся уста твои."	//
	},
	{"буде аки светоч",		// 65
	 "... и да воссияет над ним свет!"},
	{"глаголят небеса",
	 "... понесутся меткие стрелы молний из облаков."},
	{"створисте огненну струя",
	 "... и ввергне их в озеро огненное."},
	{"гнев божиа не минути",
	 "... и воспламенится гнев Господа, и Он скоро истребит тебя."},
	{"буде чахнуть",
	 "... и силу могучих ослабляет."},
	{"други, низовати мечетны",	// 70
	 "... возвещай всем великую силу Бога. И, сказав сие, они стали невидимы."},
	{"будут тени и туман, и мрак ночной",
	 "... распростираются вечерние тени."},
	{"жги аки смола горячая",
	 "... подобно мучению от скорпиона."},
	{"будь целым, аки прежде",
	 "... заделаю трещины в ней и разрушенное восстановлю."},
	{"возросши к небу",
	 "... и плоть выросла."},
	{"падоша в тернии",		// 75
	 "... убойся того, кто по убиении ввергнет в геенну."	//
	},
	{"да коснется тебя Чернобог",
	 "... плоть твоя и тело твое будут истощены."},
	{"сети ловчи",
	 "... терны и сети на пути коварного."},
	{"от стрел укрытие и от меча оборона",
	 "...да защитит он себя."},
	{"буде быстр аки прежде",
	 "... встань, и ходи."},
	{"\n!Маскировка!",		// 80
	 "\n"},
	{"згола застить очеса",
	 "... поразит тебя Господь слепотою навечно."},
	{"их очеса непотребны",
	 "... и Он поразил их слепотою."},
	{"згола не прерчет",
	 "... исходящее из уст твоих, да не осквернит слуха."	//
	},
	{"буде полон здоровья",
	 "... крепкое тело лучше несметного богатства."},
	{"воскресе из мертвых",		// 85
	 "... оживут мертвецы Твои, восстанут мертвые тела!"},
	{"и ворога оберегись",
	 "... руками своими да защитит он себя"},
	{"вороги не войдут",
	 "... ибо положена печать, и никто не возвращается."},
	{"их уста непотребны",
	 "... да замкнутся уста ваши."	//
	},
	{"глаголите",
	 "... слова из уст мудрого - благодать."},
	{"падош",			// 90
	 "... будет чувствовать боль."},
	{"скверна",
	 "... постигнут тебя муки."},
	{"сильна скверна",
	 "... боль и муки схватили."},
	{"порча их",
	 "... прокляты вы пред всеми скотами."},
	{"суд божиа не минути",
	 "... какою мерою мерите, такою отмерено будет и вам."	//
	},
	{"крыла им створисте",		// 95
	 "... и все летающие по роду их."},
	{"други, наполнися ратнаго духа",
	 "... блажены те, слышащие слово Божие."	//
	},
	{"буде свеж",
	 "... не будет у него ни усталого, ни изнемогающего."},
	{"да обратит тебя Чернобог в мертвый камень!",
	 "... и проклял его именем Господним."},
	{"\n!Спрятался!",
	 "\n"},
	{"\n!Крадется!",		// 100
	 "\n"},
	{"\n!Опьянение!",
	 "\n"},
	{"\n!Абстиненция!",
	 "\n"},
	{"брюхо полно",
	 "... душа больше пищи, и тело - одежды."},
	{"веют ветры",
	 "... подует северный холодный ветер."},
	{"\n!Получил в бою!",		// 105
	 "\n"},
	{"\n!Кровотечение!",
	 "\n"},
	{"\n!Ярость!",
	 "\n"},
	{"не затвори темне березе",
	 "... дух дышит, где хочет."},
	{"немочь",
	 "...и помедлил еще семь дней других."},
	{"скор аки ястреб",		// 110
	 "... поднимет его ветер и понесет, и он быстро побежит от него."},
	{"тернии им",
	 "... загорожу путь их тернами."},
	{"быстры аки ястребов стая",
	 "... и они быстры как серны на горах."},
	{"Живый в помощи Вышняго",
	 "... благословен буде Грядый во имя Господне."	//
	},
	{"нутро снеде",
	 "... и сделаются жестокие и кровавые язвы."	//
	},
	{"Навь, очисти тело",		// 115
	 "... хочу, очистись."		//
	},
	{"око недреманно",
	 "... не дам сна очам моим и веждам моим - дремания."},
	{"\n!молитва или жертва!",
	 "\n"},
	{"Стрибог, даруй прибежище",
	 "... защита от ветра и покров от непогоды."},
	{"буде путь короток",
	 "... входите во врата Его."},
	{"изыде ворожба",		// 120
	 "... выйди, дух нечистый."},
	{"Сварог, даруй защитника",
	 "... и благословен защитник мой!"},
	{"заживет, аки на собаке",
	 "... нет богатства лучше телесного здоровья."},
	{"будовати стружие",
	 "...вооружите из себя людей на войну"},
	{"Хорс, даруй прибежище",
	 "... душа горячая, как пылающий огонь."},
	{"Стрибог, укажи путь...",		// 125
	 "... указывай им путь, по которому они должны идти."},
	{"Дажьбог, даруй защитника",
	 "... Ангел Мой с вами, и он защитник душ ваших."},
	{"Морена, даруй прибежище",
	 "... а снег и лед выдерживали огонь и не таяли."},
	{"торже, яко вихор",
	 "... и град, величиною в талант, падет с неба."	//
	},
	{"буде мал аки мышь",
	 "... плоть на нем пропадает."},
	{"засти очи им",		// 130
	 "... свет пламени из средины огня."},
	{"згола яростен",
	 "... и ярость его загорелась в нем."},
	{"гладь воды отразит",
	 "... воздай им по делам их, по злым поступкам их."},
	{"и будут стрелы молний, и зарницы в высях",
	 "... соберу на них бедствия и истощу на них стрелы Мои."},
	{"Умри!",
	 "... и услышав слова сии - пал бездыханен."},
	{"идти дождю стрелами",		// 135
	 "... и камни, величиною в талант, падут с неба."	//
	},
	{"сильны велетов руки",
	 "... рука Моя пребудет с ним, и мышца Моя укрепит его."},
	{"разум аки мутный омут",
	 "... и безумие его с ним."},
	{"окружен радугой",
	 "... явится радуга в облаке."},
	{"зло творяще",
	 "... и ты воздашь им злом."},
	{"Стрибог, даруй защиту.",		// 140
	 ".... четыре ветра земли."},
	{"Сварог, даруй защиту.",
	 "... и огонь низводит с неба."},
	{"Морена, даруй защиту.",
	 "... текущие холодные воды."},
	{"будет слеп и глух, аки мертвец",
	 "... кто делает или глухим, или слепым."},
	{"Аз воздам!",
	 "... и воздам каждому из вас."},
	{"иже во святых, други",
	 "... будьте святы, аки Господь наш свят."	//
	},
	{"други, буде окружены радугой",
	 "... взгляни на радугу, и прославь Сотворившего ее."},
	{"оглохни",
	 "... и глухота поразит тебя."},	//SPELL_DEAFNESS
	{"да застит уши твои",
	 "... и будь глухим надолго."},	//SPELL_POWER_DEAFNESS
	{"слушай глас мой",
	 "... услышь слово Его."},	//SPELL_REMOVE_DEAFNESS
	{"будьте глухи",
	 "... и не будут слышать уши ваши."},	//SPELL_MASS_DEAFNESS
	{"пыль поднимется столбами",
	 "... и пыль поглотит вас."},	//SPELL_DUSTSTORM
	{"пусть каменья падут",
	 "... и обрушатся камни с небес."},	//SPELL_EARTHFALL
	{"да невзлюбит тебя воздух",
	 "... и даже воздух покарает тебя."},	//SPELL_SONICWAVE
	{"Велес, упокой мертвых",
	 "... и предоставь мертвым погребать своих мертвецов."},	//SPELL_HOLYSTRIKE
	{"Боги, даруйте защитника",
	 "... дабы уберег он меня от зла."},	//SPELL_ANGEL
	{"Поврещу сташивые души их в скарядие!",	//Added by Niker
	 "... и затмил ужас разум их."},	//SPELL_MASS_FEAR
	{"Да пребудет с тобой вся краса мира!",
	 "... и омолодил он, и украсил их."},
	{"Будут слезы твои, аки камень на сердце",
	 "... и постигнет твой дух угнетение вечное."},	//SPELL_CRYING
	{"будь живот аки буява с шерстнями.",	// Добавлено. Далим.
	 "... опадет на тебя чернь страшная."},	// SPELL_OBLIVION
	{"Яко небытие нещадно к вам, али время вернулось вспять.",	// Добавлено. Далим.
	 "... и время не властно над ними."},	// SPELL_BURDEN_OF_TIME
	{"Исполняше други силою!",	//SPELL_GROUP_REFRESH
	 "...да не останется ни обделенного ни обессиленого."},
	{"Избавь речь свою от недобрых слов, а ум - от крамольных мыслей.",
	 "... любите врагов ваших и благотворите ненавидящим вас."},
	{"\n!получил в бою!",
	 "\n"},
	{"\n!Предсмертная ярость!",
	 "\n"},
	{"Обращу кости их в твердый камень.",
	 "...и тот, кто упадет на камень сей, разобьется."}, // SPELL_STONE_BONE
	{"Да буде СВЕТ !!!",
	 "...ибо сказал МОНТЕР !!!"}, // SPELL_ROOM_LIGHT
	{"Порчу воздух !!!",
	 "...и зловонное дыхание его."}, // SPELL_POISONED_FOG
	{"Дети ПЕРУНА покарают вас !!!",
	 "...и молнии як мечи в их руках."}, // SPELL_THUNDERSTORM
	{"\n!легкая поступь!",
	 "\n"},
	{"аще доля зла и удача немилостива",
	 ".. и несчастен, и жалок, и нищ."},
	{"\n!кланаффект!",
	 "\n"},
	{"зрети супостат охабиша",
	 "...и бросали пыль на воздух."}, //SPELL_GLITTERDUST
	{"язвень голки уведати",
	 "...но в полночь раздался крик."}, //SPELL_SCREAM
	{"ристати споро",
	 "...и не уязвит враг того, кто скор."}, //SPELL_CATS_GRACE
	{"руци яре ворога супротив",
	 "...и мощь звериная жила в теле его."},
	{"веси и зрети стези отай",
	 "...и даровал мудрость ему."},
	{"клюка вящего улучити",
	 "...ибо кто познал ум Господень?"},
	{"Эй, псы шелудивые, керасти плешивые, ослопы беспорточные, мшицы задочные!", // клич вызова
	 "Эй, псы шелудивые, керасти плешивые, ослопы беспорточные, мшицы задочные!"},
	{"Покрошу-изувечу, душу выну и в блины закатаю!", // клич угрозы
	 "Покрошу-изувечу, душу выну и в блины закатаю!"},
	{"Не отступим, други, они наше сало сперли!", // клич ярости
	 "Не отступим, други, они наше сало сперли!"},
	{"Умри, но сдохни!", // клич безумия
	 "Умри, но сдохни!"},
	{"Шоб вас приподняло, да шлепнуло!!!",
	 "Шоб вас приподняло да шлепнуло!!!"},
	{"Всех убью, а сам$g останусь!", // клич устрашения
	 "Всех убью, а сам$g останусь!"},
	{"Дер-ржать строй, волчьи хвосты!", // клич битвы
	 "Дер-ржать строй, волчьи хвосты!"},
	{"Сарынь на кичку!",
	 "Сарынь на кичку!"},
	{"Стоять крепко! За нами Киев, Подол и трактир с пивом!!!",
	 "Стоять крепко! За нами Киев, Подол и трактир с пивом!!!"},
	{"Орлы! Будем биться как львы!",
	 "Орлы! Будем биться как львы!"}, //SPELL_WC_OF_COURAGE
    {"...пьсати черты и резы.",
    "...и Сам отошел от них на вержение камня."}, // SPELL_MAGIC_LABEL
	{"трутизна",
	 "... и пошлю на них зубы зверей и яд ползающих по земле."}, // SPELL_ACONITUM_POISON
	{"трутизна",
	 "... и пошлю на них зубы зверей и яд ползающих по земле."}, // SPELL_SCOPOLIA_POISON
	{"трутизна",
	 "... и пошлю на них зубы зверей и яд ползающих по земле."}, // SPELL_BELENA_POISON
	{"трутизна",
	 "... и пошлю на них зубы зверей и яд ползающих по земле."}, // SPELL_DATURA_POISON
	 {"\n",
	 "\n"}, // SPELL_TIMER_REPAIR
	 {"\n",
	 "\n"}, // SPELL_LACKY
	 {"\n",
	 "\n"}, // SPELL_BANDAGE
	 {"\n",
	 "\n"}, // SPELL_NO_BANDAGE
	 {"\n",
	 "\n"}, // SPELL_CAPABLE
	 {"\n",
	 "\n"}, // SPELL_STRANGLE
	 {"\n",
	 "\n"} // SPELL_RECALL_SPELLS
};

namespace
{

const char* tmp_npc_race_types[] =
{
	"босс",
	"адд",
	"танк",
	"мели-дамагер",
	"лучник",
	"тать",
	"маг-дамагер",
	"маг-суппорт",
	"хилер"
};

} //namespace

// MSVS 2012 c++11 suck
const std::vector<const char*> npc_role_types(tmp_npc_race_types,
	tmp_npc_race_types + sizeof(tmp_npc_race_types) / sizeof(const char*));

//Polud new mob races. (26/01/2009)
const char *npc_race_types[] = { "Обычный",
								"Человек",
								"Человеко-зверь",
								"Птица",
								"Животное",
								"Пресмыкающееся",
								"Рыба",
								"Насекомое",
								"Растение",
								"Предмет",
								"Живой труп",
								"Призрак",
								"Нечисть",
								"Нематериальный дух",
								"Магическое создание",
								"\n"
};
//-Polud

const char *places_of_birth[] = { "Киев",
								"Новгород",
								"\n"
};

int rev_dir[] =
{
	2,
	3,
	0,
	1,

#if defined(OASIS_MPROG)
	// * Definitions necessary for MobProg support in OasisOLC
	const char *mobprog_types[] = { "INFILE",
		"ACT",
		"SPEECH",
		"RAND",
		"FIGHT",
		"DEATH",
		"HITPRCNT",
		"ENTRY",
		"GREET",
		"ALL_GREET",
		"GIVE",
		"BRIBE",
		"\n"
	};
#endif

	5, 4
};


int movement_loss[] =
{
	1,			// Inside
	1,			// City
	2,			// Field
	3,			// Forest
	4,			// Hills
	6,			// Mountains
	4,			// Swimming
	1,			// Unswimable
	1,			// Flying
	5,			// Underwater
	1,			// Secret
	1, // Мощеная дорога
	2, // Утоптанная дорога
	4, // Разбитая дорога
	0, 0, 0, 0, 0, 0,
	3,			// Field snow
	4,			// Field water
	4,			// Forest snow
	5,			// Forest water
	5,			// Hills snow
	6,			// Hills water
	8,			// Mountains snow
	2,			// THIN ice
	2,			// NORMAL ice
	2
};

// Not used in sprinttype().
const char *weekdays[] = { "Понедельник",
						   "Вторник",
						   "Среда",
						   "Четверг",
						   "Пятница",
						   "Суббота",
						   "Воскресенье"
						 };

const char *weekdays_poly[] = { "Понедельник",
								"Вторник",
								"Третейник",
								"Четверг",
								"Пятница",
								"Шестица",
								"Седмица",
								"Осмица",
								"Неделя"
							  };


// Not used in sprinttype().
const char *month_name[] = { "Сичень",
							 "Лютень",
							 "Березозол",
							 "Цветень",
							 "Травень",
							 "Червень",
							 "Страдник",
							 "Серпень",
							 "Вересень",
							 "Листопадник",
							 "Листогной",
							 "Студень"
						   };
const char *month_name_real[] = { "Январь",
							 "Февраль",
							 "Март",
							 "Апрель",
							 "Май",
							 "Июнь",
							 "Июль",
							 "Август",
							 "Сентябрь",
							 "Октябрь",
							 "Ноябрь",
							 "Декабрь"
						   };

const char *month_name_poly[] = { "Бейлет - Месяц Белого Сияния и Покоя Мира",
								  "Гэйлет - Месяц Вьюг и Стужи",
								  "Дайлет - Месяц Пробуждения Природы",
								  "Элет - Месяц Посева и Наречения",
								  "Вэйлет - Месяц Ветров",
								  "Хейлет - Месяц Получения Даров Природы",
								  "Тайлет - Месяц Завершения",
								  "Рамхат - Месяц Божественного Начала",
								  "Айлет - Месяц Новых Даров"
								};


const char *month_name_o[] = { "месяц Зимы",
							   "месяц Зимнего Волка",
							   "месяц Снежного Гиганта",
							   "месяц Старых Сил",
							   "месяц Великого Поворота",
							   "месяц Весны",
							   "месяц Природы",
							   "месяц Равноденствия",
							   "месяц Дракона",
							   "месяц Солнца",
							   "месяц Света",
							   "месяц Битв",
							   "месяц Темных Сил",
							   "месяц Теней",
							   "месяц Длинных Теней",
							   "месяц Древней Тьмы",
							   "месяц Великого Зла"
							 };

const char *weapon_affects[] = { "слепота",
								 "невидимость",
								 "опр.наклонностей",
								 "опр.невидимости",
								 "опр.магии",
								 "опр.жизни",
								 "водохождение",
								 "освящение",
								 "проклятие",
								 "инфравидение",
								 "яд",
								 "защита.от.тьмы",
								 "защита.от.света",
								 "сон",
								 "не.выследить",
								 "доблесть",
								 "подкрадывание",
								 "спрятаться",
								 "оцепенение",
								 "полет",
								 "молчание",
								 "настороженность",
								 "мигание",
								 "не.сбежать",
								 "свет",
								 "освещение",
								 "тьма",
								 "опр.яда",
								 "медлительность",
								 "ускорение",
								 "\n",
								 "дыхание.водой",
								 "кровотечение",
								 "маскировка",
								 "защита.богов",
								 "воздушный.щит",
								 "огненный.щит",
								 "ледяной.щит",
								 "зеркало.магии",
								 "каменная.рука",
								 "призматическая.аура",
								 "воздушная.аура",
								 "огненная.аура",
								 "ледяная.аура",
								 "глухота",
								 "\n",
								 "\n",
								 "\n"
							   };

struct weapon_affect_types weapon_affect[] = {
	{(0 | (1 << 0)), 0, SPELL_BLINDNESS},
	{(0 | (1 << 1)), AFF_INVISIBLE, 0},
	{(0 | (1 << 2)), AFF_DETECT_ALIGN, 0},
	{(0 | (1 << 3)), AFF_DETECT_INVIS, 0},
	{(0 | (1 << 4)), AFF_DETECT_MAGIC, 0},
	{(0 | (1 << 5)), AFF_SENSE_LIFE, 0},
	{(0 | (1 << 6)), AFF_WATERWALK, 0},
	{(0 | (1 << 7)), AFF_SANCTUARY, 0},
	{(0 | (1 << 8)), AFF_CURSE, 0},
	{(0 | (1 << 9)), AFF_INFRAVISION, 0},
	{(0 | (1 << 10)), 0, SPELL_POISON},
	{(0 | (1 << 11)), AFF_PROTECT_EVIL, 0},
	{(0 | (1 << 12)), AFF_PROTECT_GOOD, 0},
	{(0 | (1 << 13)), 0, SPELL_SLEEP},
	{(0 | (1 << 14)), AFF_NOTRACK, 0},
	{(0 | (1 << 15)), AFF_BLESS, 0},
	{(0 | (1 << 16)), AFF_SNEAK, 0},
	{(0 | (1 << 17)), AFF_HIDE, 0},
	{(0 | (1 << 18)), 0, SPELL_HOLD},
	{(0 | (1 << 19)), AFF_FLY, 0},
	{(0 | (1 << 20)), AFF_SIELENCE, 0},
	{(0 | (1 << 21)), AFF_AWARNESS, 0},
	{(0 | (1 << 22)), AFF_BLINK, 0},
	{(0 | (1 << 23)), AFF_NOFLEE, 0},
	{(0 | (1 << 24)), AFF_SINGLELIGHT, 0},
	{(0 | (1 << 25)), AFF_HOLYLIGHT, 0},
	{(0 | (1 << 26)), AFF_HOLYDARK, 0},
	{(0 | (1 << 27)), AFF_DETECT_POISON, 0},
	{(0 | (1 << 28)), AFF_SLOW, 0},
	{(0 | (1 << 29)), AFF_HASTE, 0},
	{(INT_ONE | (1 << 0)), AFF_WATERBREATH, 0},
	{(INT_ONE | (1 << 1)), AFF_HAEMORRAGIA, 0},
	{(INT_ONE | (1 << 2)), AFF_CAMOUFLAGE, 0},
	{(INT_ONE | (1 << 3)), AFF_SHIELD, 0},
	{(INT_ONE | (1 << 4)), AFF_AIRSHIELD, 0},
	{(INT_ONE | (1 << 5)), AFF_FIRESHIELD, 0},
	{(INT_ONE | (1 << 6)), AFF_ICESHIELD, 0},
	{(INT_ONE | (1 << 7)), AFF_MAGICGLASS, 0},
	{(INT_ONE | (1 << 8)), AFF_STONEHAND, 0},
	{(INT_ONE | (1 << 9)), AFF_PRISMATICAURA, 0},
	{(INT_ONE | (1 << 10)), AFF_AIRAURA, 0},
	{(INT_ONE | (1 << 11)), AFF_FIREAURA, 0},
	{(INT_ONE | (1 << 12)), AFF_ICEAURA, 0},
	{(INT_ONE | (1 << 13)), AFF_DEAFNESS, 0},
	{ -1, -1, -1}			// Always last
};

const char *pray_metter[] = { "- Яриле",
							  "- Макоши",
							  "- Перуну",
							  "- Велесу",
							  "* Пресвятой-Богородице",
							  "* Николе-Угоднику",
							  "* Илие-Пророку",
							  "* Георгию-Победоносцу",
							  "\n"
							};

const char *pray_whom[] = { "Яриле",
							"Макоши",
							"Перуну",
							"Велесу",
							"Пресвятой-Богородице",
							"Николе-Угоднику",
							"Илие-Пророку",
							"Георгию-Победоносцу",
							"\n"
						  };

// Fields : whom location modifier bitvector battleflag
struct pray_affect_type pray_affect[] = { {0, APPLY_NONE, 0, AFF_INFRAVISION, 0},	// Ярило
	{1, APPLY_HITREG, 50, 0, 0},	// Мокошь
	{2, APPLY_STR, 1, 0, 0},	// Перун
	{3, APPLY_DEX, 1, 0, 0},	// Велес
	{4, APPLY_MORALE, 5, 0, 0},	// Дева Мария
	{5, APPLY_INT, 1, 0, 0},	// Никола Угодник
	{6, APPLY_HITROLL, 2, 0, 0},	// Илия Пророк
	{7, APPLY_DAMROLL, 1, 0, 0},	// Григорий Победоносец
	{ -1, -1, -1, -1, -1}
};

// Количество маны волхва
int mana[] = { 0,		// Wiz= 0
			   100,			// Wiz= 1
			   250,			// Wiz= 2
			   500,			// Wiz= 3
			   750,			// Wiz= 4
			   1000,			// Wiz= 5
			   1250,			// Wiz= 6
			   1500,			// Wiz= 7
			   1750,			// Wiz= 8
			   2000,			// Wiz= 9
			   2250,			// Wiz=10
			   2500,			// Wiz=11
			   2750,			// Wiz=12
			   3000,			// Wiz=13
			   3250,			// Wiz=14
			   3500,			// Wiz=15
			   3650,			// Wiz=16
			   3900,			// Wiz=17
			   4000,			// Wiz=18
			   4300,			// Wiz=19
			   4600,			// Wiz=20
			   4900,			// Wiz=21
			   5200,			// Wiz=22
			   5500,			// Wiz=23
			   5800,			// Wiz=24
			   5920,			// Wiz=25
			   5930,			// Wiz=26
			   5940,			// Wiz=27
			   5950,			// Wiz=28
			   5960,			// Wiz=29
			   5970,			// Wiz=30
			   5980,			// Wiz=31
			   5990,			// Wiz=32
			   6000,			// Wiz=33
			   6000,			// Wiz=34
			   6000,			// Wiz=35
			   6000,			// Wiz=36
			   6000,			// Wiz=37
			   6000,			// Wiz=38
			   6000,			// Wiz=39
			   6000,			// Wiz=40
			   6000,			// Wiz=41
			   6000,			// Wiz=42
			   6000,			// Wiz=43
			   6000,			// Wiz=44
			   6000,			// Wiz=45
			   6000,			// Wiz=46
			   6000,			// Wiz=47
			   6000,			// Wiz=48
			   6000,			// Wiz=49
			   6000			// Wiz=50
			 };

// Количество гейн маны волхва в секунду в зависимости от инты
int mana_gain_cs[] = { 2,	// Int= 0
					   3,			// Int= 1
					   3,			// Int= 2
					   4,			// Int= 3
					   4,			// Int= 4
					   5,			// Int= 5
					   5,			// Int= 6
					   6,			// Int= 7
					   6,			// Int= 8
					   7,			// Int= 9
					   7,			// Int=10
					   8,			// Int=11
					   8,			// Int=12
					   9,			// Int=13
					   9,			// Int=14
					   10,			// Int=15
					   11,			// Int=16
					   12,			// Int=17
					   13,			// Int=18
					   14,			// Int=19
					   15,			// Int=20
					   16,			// Int=21
					   17,			// Int=22
					   18,			// Int=23
					   19,			// Int=24
					   20,			// Int=25
					   22,			// Int=26
					   24,			// Int=27
					   26,			// Int=28
					   27,			// Int=29
					   29,			// Int=30
					   31,			// Int=31
					   33,			// Int=32
					   35,			// Int=33
					   37,			// Int=34
					   39,			// Int=35
					   41,			// Int=36
					   44,			// Int=37
					   47,			// Int=38
					   50,			// Int=39
					   53,			// Int=40
					   56,			// Int=41
					   59,			// Int=42
					   62,			// Int=43
					   65,			// Int=44
					   68,			// Int=45
					   71,			// Int=46
					   74,			// Int=47
					   77,			// Int=48
					   80,			// Int=49
					   83			// Int=50
					 };

// Стоимость заклинаний волхва в зависимоти от круга и уровня
int mana_cost_cs[][9] = {
						//Круг	1й   2й    3й    4й    5й    6й    7й    8й    9й
							{9999, 9999, 9999, 9999, 9999, 9999, 9999, 9999, 9999},	// Lev  0
							{1143, 9999, 9999, 9999, 9999, 9999, 9999, 9999, 9999},	// Lev  1
							{1000, 9999, 9999, 9999, 9999, 9999, 9999, 9999, 9999},	// Lev  2
							{950, 1250, 9999, 9999, 9999, 9999, 9999, 9999, 9999},	// Lev  3
							{880, 990, 9999, 9999, 9999, 9999, 9999, 9999, 9999},	// Lev  4
							{830, 900, 9999, 9999, 9999, 9999, 9999, 9999, 9999},	// Lev  5
							{780, 850, 9999, 9999, 9999, 9999, 9999, 9999, 9999},	// Lev  6
							{710, 660, 1000, 9999, 9999, 9999, 9999, 9999, 9999},	// Lev  7
							{560, 600, 770, 9999, 9999, 9999, 9999, 9999, 9999},	// Lev  8
							{500, 600, 700, 9999, 9999, 9999, 9999, 9999, 9999},	// Lev  9
							{450, 550, 640, 9999, 9999, 9999, 9999, 9999, 9999},	// Lev 10
							{390, 460, 540, 9999, 9999, 9999, 9999, 9999, 9999},	// Lev 11
							{360, 430, 500, 1000, 9999, 9999, 9999, 9999, 9999},	// Lev 12
							{330, 400, 470, 800, 9999, 9999, 9999, 9999, 9999},	// Lev 13
							{300, 350, 410, 700, 9999, 9999, 9999, 9999, 9999},	// Lev 14
							{280, 330, 390, 560, 9999, 9999, 9999, 9999, 9999},	// Lev 15
							{250, 300, 350, 500, 1000, 9999, 9999, 9999, 9999},	// Lev 16
							{230, 270, 320, 450, 630, 9999, 9999, 9999, 9999},	// Lev 17
							{200, 240, 280, 400, 560, 9999, 9999, 9999, 9999},	// Lev 18
							{190, 220, 260, 370, 520, 1000, 9999, 9999, 9999},	// Lev 19
							{180, 210, 250, 360, 500, 620, 9999, 9999, 9999},	// Lev 20
							{160, 190, 230, 320, 450, 560, 9999, 9999, 9999},	// Lev 21
							{160, 190, 220, 310, 440, 550, 9999, 9999, 9999},	// Lev 22
							{150, 180, 210, 300, 430, 530, 9999, 9999, 9999},	// Lev 23
							{150, 180, 210, 300, 410, 510, 1000, 9999, 9999},	// Lev 24
							{140, 170, 200, 290, 400, 500, 750, 9999, 9999},	// Lev 25
							{130, 160, 180, 260, 370, 460, 600, 9999, 9999},	// Lev 26
							{120, 150, 170, 240, 340, 430, 550, 1000, 9999},	// Lev 27
							{120, 140, 160, 230, 320, 410, 490, 750, 9999},	// Lev 28
							{110, 130, 160, 220, 310, 390, 470, 670, 9999},	// Lev 29
							{100, 120, 140, 200, 280, 350, 420, 600, 1300},	// Lev 30
							{1, 1, 1, 1, 1, 1, 1, 1, 1},	// Lev 31
							{1, 1, 1, 1, 1, 1, 1, 1, 1},	// Lev 32
							{1, 1, 1, 1, 1, 1, 1, 1, 1},	// Lev 33
							{1, 1, 1, 1, 1, 1, 1, 1, 1}	// Lev 34
						};


//MZ.load
struct zone_type * zone_types = NULL;
//-MZ.load

// Круги, доступные волхвам в зависимости от уровня
// НЕ ИСПОЛЬЗУЕТСЯ
/*
int druid_circles[] =
{
   0, //0
   1, //1
   1, //2
   2, //3
   2, //4
   2, //5
   2, //6
   3, //7
   3, //8
   3, //9
   3, //10
   3, //11
   4, //12
   4, //13
   4, //14
   4, //15
   5, //16
   5, //17
   5, //18
   6, //19
   6, //20
   6, //21
   6, //22
   6, //23
   7, //24
   7, //25
   7, //26
   8, //27
   8, //28
   8, //29
   9, //30
   10, //31
   10, //32
   10, //33
   10, //34
};
*/
/* !!!!! ПЕРЕНОС ПОКА НЕ ОСУЩЕСТВЛЕН -- ВСЕ ЧТО НИЖЕ ПОКА НЕ СООТВЕТСТВУЕТ ИСТИНЕ
// Раньше находилось в basic.lst в ManaPerTic (параметр для int) -- реген маны немановыми кастерами, будет использоваться,
// пока все спеллы не будут переведены на новый стандарт
int mana_gain_old[] =
{    10,   // Int= 0
     10,   // Int= 1
     10,   // Int= 2
     10,   // Int= 3
     15,   // Int= 4
     20,   // Int= 5
     25,   // Int= 6
     30,   // Int= 7
     40,   // Int= 8
     50,   // Int= 9
     60,   // Int=10
     63,   // Int=11
     66,   // Int=12
     69,   // Int=13
     72,   // Int=14
    75,   // Int=15
    78,   // Int=16
    81,   // Int=17
    84,   // Int=18
    87,   // Int=19
    90,   // Int=20
    92,   // Int=21
    94,   // Int=22
    96,   // Int=23
    98,   // Int=24
    100,   // Int=25
    105,   // Int=26
    110,   // Int=27
    115,   // Int=28
    120,   // Int=29
    130,   // Int=30
    135,   // Int=31
    140,   // Int=32
    145,   // Int=33
    150,   // Int=34
    153,   // Int=35
    155,   // Int=36
    158,   // Int=37
    160,   // Int=38
    163,   // Int=39
    165,   // Int=40
    168,   // Int=41
    170,   // Int=42
    173,   // Int=43
    175,   // Int=44
    178,   // Int=45
    180,   // Int=46
    185,   // Int=47
    190,   // Int=48
    195,   // Int=49
    200    // Int=50
};
*/


// Круги, доступные волхвам в зависимости от уровня
// НЕ ИСПОЛЬЗУЕТСЯ
/*
int druid_circles[] =
{
   0, //0
   1, //1
   1, //2
   2, //3
   2, //4
   2, //5
   2, //6
   3, //7
   3, //8
   3, //9
   3, //10
   3, //11
   4, //12
   4, //13
   4, //14
   4, //15
   5, //16
   5, //17
   5, //18
   6, //19
   6, //20
   6, //21
   6, //22
   6, //23
   7, //24
   7, //25
   7, //26
   8, //27
   8, //28
   8, //29
   9, //30
   10, //31
   10, //32
   10, //33
   10, //34
};
*/
/* !!!!! ПЕРЕНОС ПОКА НЕ ОСУЩЕСТВЛЕН -- ВСЕ ЧТО НИЖЕ ПОКА НЕ СООТВЕТСТВУЕТ ИСТИНЕ
// Раньше находилось в basic.lst в ManaPerTic (параметр для int) -- реген маны немановыми кастерами, будет использоваться,
// пока все спеллы не будут переведены на новый стандарт
int mana_gain_old[] =
{    10,   // Int= 0
     10,   // Int= 1
     10,   // Int= 2
     10,   // Int= 3
     15,   // Int= 4
     20,   // Int= 5
     25,   // Int= 6
     30,   // Int= 7
     40,   // Int= 8
     50,   // Int= 9
     60,   // Int=10
     63,   // Int=11
     66,   // Int=12
     69,   // Int=13
     72,   // Int=14
    75,   // Int=15
    78,   // Int=16
    81,   // Int=17
    84,   // Int=18
    87,   // Int=19
    90,   // Int=20
    92,   // Int=21
    94,   // Int=22
    96,   // Int=23
    98,   // Int=24
    100,   // Int=25
    105,   // Int=26
    110,   // Int=27
    115,   // Int=28
    120,   // Int=29
    130,   // Int=30
    135,   // Int=31
    140,   // Int=32
    145,   // Int=33
    150,   // Int=34
    153,   // Int=35
    155,   // Int=36
    158,   // Int=37
    160,   // Int=38
    163,   // Int=39
    165,   // Int=40
    168,   // Int=41
    170,   // Int=42
    173,   // Int=43
    175,   // Int=44
    178,   // Int=45
    180,   // Int=46
    185,   // Int=47
    190,   // Int=48
    195,   // Int=49
    200    // Int=50
};
*/


// Круги, доступные волхвам в зависимости от уровня
// НЕ ИСПОЛЬЗУЕТСЯ
/*
int druid_circles[] =
{
   0, //0
   1, //1
   1, //2
   2, //3
   2, //4
   2, //5
   2, //6
   3, //7
   3, //8
   3, //9
   3, //10
   3, //11
   4, //12
   4, //13
   4, //14
   4, //15
   5, //16
   5, //17
   5, //18
   6, //19
   6, //20
   6, //21
   6, //22
   6, //23
   7, //24
   7, //25
   7, //26
   8, //27
   8, //28
   8, //29
   9, //30
   10, //31
   10, //32
   10, //33
   10, //34
};
*/
/* !!!!! ПЕРЕНОС ПОКА НЕ ОСУЩЕСТВЛЕН -- ВСЕ ЧТО НИЖЕ ПОКА НЕ СООТВЕТСТВУЕТ ИСТИНЕ
// Раньше находилось в basic.lst в ManaPerTic (параметр для int) -- реген маны немановыми кастерами, будет использоваться,
// пока все спеллы не будут переведены на новый стандарт
int mana_gain_old[] =
{    10,   // Int= 0
     10,   // Int= 1
     10,   // Int= 2
     10,   // Int= 3
     15,   // Int= 4
     20,   // Int= 5
     25,   // Int= 6
     30,   // Int= 7
     40,   // Int= 8
     50,   // Int= 9
     60,   // Int=10
     63,   // Int=11
     66,   // Int=12
     69,   // Int=13
     72,   // Int=14
    75,   // Int=15
    78,   // Int=16
    81,   // Int=17
    84,   // Int=18
    87,   // Int=19
    90,   // Int=20
    92,   // Int=21
    94,   // Int=22
    96,   // Int=23
    98,   // Int=24
    100,   // Int=25
    105,   // Int=26
    110,   // Int=27
    115,   // Int=28
    120,   // Int=29
    130,   // Int=30
    135,   // Int=31
    140,   // Int=32
    145,   // Int=33
    150,   // Int=34
    153,   // Int=35
    155,   // Int=36
    158,   // Int=37
    160,   // Int=38
    163,   // Int=39
    165,   // Int=40
    168,   // Int=41
    170,   // Int=42
    173,   // Int=43
    175,   // Int=44
    178,   // Int=45
    180,   // Int=46
    185,   // Int=47
    190,   // Int=48
    195,   // Int=49
    200    // Int=50
};
*/

// Weapon attack texts
struct attack_hit_type attack_hit_text[] =
{
	{"ударил", "ударить"},	// 0
	{"ободрал", "ободрать"},
	{"хлестнул", "хлестнуть"},
	{"рубанул", "рубануть"},
	{"укусил", "укусить"},
	{"огрел", "огреть"},	// 5
	{"сокрушил", "сокрушить"},
	{"резанул", "резануть"},
	{"оцарапал", "оцарапать"},
	{"подстрелил", "подстрелить"},
	{"пырнул", "пырнуть"},	// 10
	{"уколол", "уколоть"},
	{"ткнул", "ткнуть"},
	{"лягнул", "лягнуть"},
	{"боднул", "боднуть"},
	{"клюнул", "клюнуть"},
	{"ужалил", "ужалить"},
	{"*", "*"},
	{"*", "*"},
	{"*", "*"}
};

const char *godslike_bits[] =
{
	"GF_GODSLIKE",
	"GF_GODSCURSE",
	"GF_HIGHGOD",
	"GF_REMORT",
	"GF_DEMIGOD",
	"GF_PERSLOG",
	"\n"
};

std::array<const char *, NUM_CLASSES> pc_class_name =
{{
	"лекарь",
	"колдун",
	"тать",
	"богатырь",
	"наемник",
	"дружинник",
	"кудесник",
	"волшебник",
	"чернокнижник",
	"витязь",
	"охотник",
	"кузнец",
	"купец",
	"волхв"
}};
